pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0007.c
// bl602_demo_wifi_text_0007.c
// Generated by decompiling bl602_demo_wifi.elf
// using Reko decompiler version 0.9.3.0.

#include "bl602_demo_wifi.h"

// 23070414: Register Eq_2 __fixdfsi(Register Eq_2 ra, Register Eq_2 a0, Register Eq_64250 a1, Register ptr32 fflags, Register ptr32 frm, Register out Eq_65065 a1Out, Register out Eq_65066 a3Out, Register out (ptr32 word32) a4Out, Register out Eq_2 a5Out)
// Called from:
//      rf_set_channel
//      trpc_get_default_power_idx
//      rf_pri_get_vco_freq_cw
//      rf_pri_get_vco_idac_cw
//      phyif_utils_decode
//      tcpip_stack_input
//      ecvtbuf
Eq_2 __fixdfsi(Eq_2 ra, Eq_2 a0, Eq_64250 a1, ptr32 fflags, ptr32 frm, union Eq_65065 & a1Out, union Eq_65066 & a3Out, word32 & a4Out, union Eq_2 & a5Out)
{
	Eq_2 a5_31;
	__csrrs(frm, fp);
	Eq_65066 a3_28 = a1 >> 0x14 & 0x07FF;
	word32 * a4_10 = (word32 *) 1022;
	if (a3_28 > 1022)
	{
		if (a3_28 > 0x041D)
		{
			a5_31 = (a1 >> 0x1F) + 0x7FFFFFFF;
			if (a1 >> 0x1F == 0x00)
			{
				a4_10 = (word32 *) 16;
				goto l230704C8;
			}
			a4_10 = (word32 *) 16;
			if (a3_28 != 0x041E)
			{
l230704C8:
				__csrrs(fflags, ra);
				goto l23070444;
			}
			a3_28 = a0 >> 0x15;
			if (((a1 & 0x000FFFFF) << 11 | a0 >> 0x15) != 0x00)
				goto l230704C8;
			a4_10 = a0 << 11;
			if (a0 << 11 != 0x00)
			{
				a4_10 = a1 >> 0x1F;
				goto l230704C8;
			}
		}
		else
		{
			uint32 a5_14 = a1 & 0x000FFFFF | 0x00100000;
			int32 a2_16 = 0x0433 - a3_28;
			if (a2_16 <= 31)
			{
				a3_28 = (word32) a3_28 - 0x0413;
				a4_10 = (word32) (a0 << (word32) a3_28 - 0x0413 != 0x00);
				a5_31 = a5_14 << (word32) a3_28 - 0x0413 | a0 >> a2_16;
			}
			else
			{
				int32 a4_19 = 0;
				if (a2_16 != 32)
					a4_19 = a5_14 << (word32) a3_28 - 1011;
				a3_28 = 0x0413 - a3_28;
				a4_10 = (word32) ((a4_19 | a0) != 0x00);
				a5_31 = a5_14 >> a3_28;
			}
			if (a1 >> 0x1F != 0x00)
				a5_31 = 0x00 - a5_31;
			if (a4_10 != null)
				goto l230704C8;
		}
l23070444:
		a1Out = a1 >> 0x1F;
		a3Out = a3_28;
		a4Out = a4_10;
		a5Out = a5_31;
		return a5_31;
	}
	else
	{
		if (a3_28 == 0x00)
		{
			a5_31 = a1 & 0x000FFFFF | a0;
			if (a5_31 == 0x00)
				goto l23070444;
		}
		a5_31.u0 = 0;
		a4_10 = (word32 *) 1;
		goto l230704C8;
	}
}

// 23070510: Register Eq_2 __fixunsdfsi(Register Eq_2 ra, Register Eq_2 a0, Register uint32 a1, Register ptr32 fflags, Register ptr32 frm, Register out Eq_65764 a4Out)
// Called from:
//      rfc_init
//      rf_pri_rccal_iq
Eq_2 __fixunsdfsi(Eq_2 ra, Eq_2 a0, uint32 a1, ptr32 fflags, ptr32 frm, union Eq_65764 & a4Out)
{
	Eq_65764 a4_16;
	Eq_2 a0_13;
	__csrrs(frm, fp);
	int32 a3_9 = a1 >> 0x14 & 0x07FF;
	if (a3_9 > 1022)
	{
		if (a1 >> 0x1F == 0x00)
		{
			if (a3_9 <= 0x041E)
			{
				uint32 a5_18 = a1 & 0x000FFFFF | 0x00100000;
				int32 a2_19 = 0x0433 - a3_9;
				if (a2_19 <= 31)
				{
					a4_16 = (word32) (a0 << a3_9 + -0x0413 != 0x00);
					a0_13 = a5_18 << a3_9 + -0x0413 | a0 >> a2_19;
				}
				else
				{
					int32 a4_22 = 0;
					if (a2_19 != 32)
						a4_22 = a5_18 << a3_9 + -1011;
					a4_16 = (word32) ((a4_22 | a0) != 0x00);
					a0_13 = a5_18 >> 0x0413 - a3_9;
				}
				if (a4_16 == 0x00)
				{
					a4Out = a4_16;
					return a0_13;
				}
				goto l23070580;
			}
			a0_13.u0 = -1;
		}
		else
			a0_13.u0 = 0;
		a4_16.u0 = 16;
		goto l23070580;
	}
	else
	{
		if (a3_9 == 0x00)
		{
			Eq_2 a0_42 = a1 & 0x000FFFFF | a0;
			if (a0_42 == 0x00)
			{
				a4Out.u0 = 0x00100000;
				return a0_42;
			}
		}
		a0_13.u0 = 0;
		a4_16.u0 = 1;
l23070580:
		__csrrs(fflags, ra);
		a4Out = a4_16;
		return a0_13;
	}
}

// 230705D8: Register Eq_64318 __floatsidf(Register Eq_64318 a0, Register out Eq_64319 a1Out)
// Called from:
//      rf_set_channel
//      pa_input
//      trpc_get_default_power_idx
//      phyif_utils_decode
//      tcpip_stack_input
//      ADC_Parse_Result
Eq_64318 __floatsidf(Eq_64318 a0, union Eq_64319 & a1Out)
{
	Eq_64318 s0_27;
	int32 a4_11;
	Eq_358889 a5_12;
	if (a0 != 0x00)
	{
		Eq_2 s0_15 = (a0 >> 0x1F ^ a0) - (a0 >> 0x1F);
		word32 a4_68;
		Eq_2 a0_18 = __clzsi2(s0_15, out a4_68);
		a4_11 = 0x041E - a0_18;
		if (a0_18 <= 0x0A)
		{
			a5_12 = s0_15 >> 11 - a0_18;
			s0_27 = s0_15 << (word32) a0_18 + 21;
			a0 >>= 0x1F;
			goto l2307062C;
		}
		a5_12 = s0_15 << (word32) a0_18 - 11;
		a0 >>= 0x1F;
	}
	else
	{
		a4_11 = 0;
		a5_12.u0 = 0;
	}
	s0_27.u0 = 0;
l2307062C:
	a1Out = (word32) (word20) a5_12 | (a4_11 & 0x07FF) << 0x14 | a0 << 0x1F;
	return s0_27;
}

// 23070684: Register Eq_2 __floatunsidf(Register Eq_2 a0, Register out Eq_65693 a1Out)
// Called from:
//      rfc_init
//      rf_pri_rccal_iq
//      rf_pri_get_vco_freq_cw
//      rf_pri_get_vco_idac_cw
//      __floatundisf
Eq_2 __floatunsidf(Eq_2 a0, union Eq_65693 & a1Out)
{
	int32 a4_11;
	Eq_358933 a5_10;
	Eq_2 s0_20 = a0;
	if (a0 != 0x00)
	{
		word32 a4_46;
		Eq_2 a0_12 = __clzsi2(a0, out a4_46);
		a4_11 = 0x041E - a0_12;
		if (a0_12 <= 0x0A)
		{
			a5_10 = a0 >> 11 - a0_12;
			s0_20 = a0 << (word32) a0_12 + 21;
		}
		else
		{
			a5_10 = a0 << (word32) a0_12 - 11;
			s0_20.u0 = 0;
		}
	}
	else
	{
		a5_10.u0 = 0;
		a4_11 = 0;
	}
	a1Out = (word32) (word20) a5_10 | (a4_11 & 0x07FF) << 0x14;
	return s0_20;
}

// 23070708: Register Eq_2 __extendsfdf2(Register Eq_2 ra, Register Eq_5614 fa0, Register ptr32 fflags, Register ptr32 frm, Register out Eq_64592 a1Out)
// Called from:
//      pa_adapt
//      rfc_init
//      tcpip_stack_input
//      bl_tsen_adc_get
//      iperf_server_udp_recv_fn
//      iperf_client_udp
//      iperf_server
//      iperf_client_tcp
//      convertDataToString
//      ADC_Parse_Result
//      TSEN_Get_Temp
Eq_2 __extendsfdf2(Eq_2 ra, Eq_5614 fa0, ptr32 fflags, ptr32 frm, union Eq_64592 & a1Out)
{
	int32 a0_31;
	Eq_358967 a5_23;
	__csrrs(frm, fp + -16);
	ui32 a0_17 = fa0 >> 0x17 & 0x00FF;
	int32 s1_20 = a0_17 + 1 & 0x00FE;
	Eq_2 s0_21 = (word32) (word23) fa0;
	if (s1_20 != 0x00)
	{
		a5_23 = s0_21 >> 0x03;
		a0_31 = a0_17 + 896;
		s0_21 <<= 0x1D;
		s1_20 = 0;
	}
	else if (a0_17 == 0x00)
	{
		if (s0_21 != 0x00)
		{
			word32 a4_131;
			Eq_2 a0_35 = __clzsi2(s0_21, out a4_131);
			if (a0_35 <= 0x0A)
			{
				a5_23 = s0_21 >> 11 - a0_35;
				s0_21 <<= (word32) a0_35 + 21;
			}
			else
			{
				a5_23 = s0_21 << (word32) a0_35 - 11;
				s0_21.u0 = 0;
			}
			a0_31 = 905 - a0_35;
		}
		else
		{
			a5_23.u0 = 0;
			a0_31 = 0;
		}
	}
	else
	{
		a5_23.u0 = 0;
		if (s0_21 != 0x00)
		{
			if (s0_21 << 0x09 >= 0x00)
				s1_20 = 16;
			s0_21 <<= 0x1D;
			a5_23 = s0_21 >> 0x03 | 0x00080000;
		}
		a0_31 = 0x07FF;
	}
	Eq_64592 a1_73 = (word32) (word20) a5_23 | (a0_31 & 0x07FF) << 0x14 | (fa0 >> 0x1F) << 0x1F;
	if (s1_20 != 0x00)
		__csrrs(fflags, ra);
	a1Out = a1_73;
	return s0_21;
}

// 23070818: Register uint32 __truncdfsf2(Register Eq_2 ra, Register Eq_2 a0, Register uint32 a1, Register ptr32 fflags, Register ptr32 frm, Register out Eq_64455 a2Out, Register out Eq_64456 a3Out, Register out (ptr32 int8) a4Out, Register out (ptr32 Eq_64458) a5Out, Register out (ptr32 Eq_64458) fa0Out)
// Called from:
//      pa_input
//      pa_adapt
//      ADC_Parse_Result
//      TSEN_Get_Temp
//      __floatundisf
uint32 __truncdfsf2(Eq_2 ra, Eq_2 a0, uint32 a1, ptr32 fflags, ptr32 frm, union Eq_64455 & a2Out, union Eq_64456 & a3Out, int8 & a4Out, struct Eq_64458 & a5Out, struct Eq_64458 & fa0Out)
{
	Eq_64455 a2_105;
	int32 a6_112;
	Eq_359054 a5_100;
	int32 t1_10 = a1 >> 0x14 & 0x07FF;
	struct Eq_84 * a7_4 = __csrrs(frm, fp);
	Eq_64456 a3_102 = a0 >> 0x1D | (word32) ((word20) a1) << 0x03;
	int32 a4_103 = t1_10 + 1 & 0x07FE;
	Eq_359077 a1_16 = a1 >> 0x1F;
	if (a4_103 != 0x00)
	{
		a6_112 = t1_10 + -896;
		if (t1_10 > -1150)
		{
			if (a7_4 != null)
			{
				if (a7_4 == (struct Eq_84 *) 3)
				{
					if (a1 >> 0x1F != 0x00)
					{
l23070868:
						a5_100.u0 = -1;
						a6_112 = 0x00FE;
						a4_103 = 0;
						a2_105.u0 = 5;
						goto l23070878;
					}
				}
				else if (a7_4 != (struct Eq_84 *) 2 || a1 >> 0x1F == 0x00)
					goto l23070868;
			}
			a5_100.u0 = 0;
			a6_112 = 0x00FF;
			a2_105.u0 = 5;
			goto l230708C4;
		}
		if (t1_10 > ~0x037F)
		{
			a5_100 = (word32) (a0 << 0x06 != 0x00) | a3_102 << 0x03 | (a0 << 0x03) >> 0x1D;
			a4_103 = 0;
			a2_105.u0 = 0;
			goto l23070A08;
		}
		if (t1_10 < -873)
		{
			a5_100.u0 = 1;
l2307096C:
			uint32 a4_74 = a5_100 << 0x01;
			a2_105.u0 = 0;
			if ((a4_74 & 7) != 0x00)
			{
				if (a7_4 != (struct Eq_84 *) 2)
				{
					if (a7_4 != (struct Eq_84 *) 3)
					{
						a2_105.u0 = 1;
						if (a7_4 == null && (a4_74 & 0x0F) != 4)
							a4_74 += 4;
					}
					else
					{
						a2_105 = a1 >> 0x1F;
						if (a1 >> 0x1F == 0x00)
						{
							a4_74 += 8;
							a2_105.u0 = 1;
						}
					}
				}
				else
				{
					a2_105.u0 = 1;
					if (a1 >> 0x1F != 0x00)
					{
						a4_74 += 8;
						a2_105 = a1 >> 0x1F;
					}
				}
			}
			a4_103 = (a4_74 >> 0x1B ^ 1) & 1;
			a6_112 = 0;
			goto l23070A08;
		}
		a3_102 |= 0x00800000;
		int32 a2_48 = 30 - (t1_10 + -896);
		if (a2_48 <= 31)
		{
			a3_102 = (word32) (a0 << 0x03 << t1_10 + -894 != 0x00) | (a3_102 | 0x00800000) << t1_10 + -894;
			a5_100 = a0 << 0x03 >> a2_48 | a3_102;
		}
		else
		{
			uint32 a6_53 = (a3_102 | 0x00800000) >> -2 - (t1_10 + -896);
			int32 a4_54 = 0;
			if (a2_48 != 32)
				a4_54 = (a3_102 | 0x00800000) << t1_10 + -862;
			a5_100 = a6_53 | (word32) ((a4_54 | a0 << 0x03) != 0x00);
		}
	}
	else
	{
		a5_100 = a3_102 | a0 << 0x03;
		if (t1_10 != 0x00)
		{
			if (a5_100 == 0x00)
			{
				a2_105.u0 = 0;
				a6_112 = 0x00FF;
				goto l230708C4;
			}
			a2_105.u0 = 0;
			if (t1_10 == 0x07FF)
				a2_105 = (word32) ((a3_102 & 0x00400000) < 1) << 0x04;
			a5_100 = a3_102 << 0x03 | 0x02000000;
			a6_112 = 0x00FF;
l23070A08:
			a3_102 = a5_100 & 7;
			if (a3_102 != 0x00)
			{
l23070878:
				a3_102.u0 = 2;
				a2_105 |= 1;
				if (a7_4 != (struct Eq_84 *) 2)
				{
					a3_102.u0 = 3;
					if (a7_4 != (struct Eq_84 *) 3)
					{
						if (a7_4 == null)
						{
							a3_102 = a5_100 & 0x0F;
							if (a3_102 != 4)
								a5_100 = (word32) a5_100.u0 + 4;
						}
						goto l230708A0;
					}
					if (a1 >> 0x1F != 0x00)
						goto l230708A0;
				}
				else if (a1 >> 0x1F == 0x00)
					goto l230708A0;
				a5_100 = (word32) a5_100.u0 + 8;
l230708A0:
				if (a4_103 != 0x00)
					a2_105 |= 2;
				goto l230708C4;
			}
			if (a4_103 != 0x00)
			{
				a4_103 = a2_105 & 1;
				goto l230708A0;
			}
l230708C4:
			if (a5_100 << 0x05 >= 0x00)
			{
l230708E4:
				uint32 a5_177 = a5_100 >> 0x03;
				if (a6_112 == 0x00FF && a5_177 != 0x00)
				{
					a5_177 = 0x00400000;
					a1_16.u0 = 0;
				}
				uint32 a1_192 = a1_16 << 0x1F;
				struct Eq_64458 * a5_194 = (word32) (word23) a5_177 | (a6_112 & 0x00FF) << 0x17 | a1_192;
				if (a2_105 != 0x00)
					__csrrs(fflags, ra);
				a2Out = a2_105;
				a3Out = a3_102;
				a4Out = (int8 *) 0x00FF;
				a5Out = a5_194;
				fa0Out = a5_194;
				return a1_192;
			}
			++a6_112;
			if (a6_112 != 0x00FF)
			{
				a5_100 &= ~0x04000000;
				goto l230708E4;
			}
			a5_100.u0 = 0;
			if (a7_4 != null)
			{
				if (a7_4 == (struct Eq_84 *) 3)
				{
					if (a1 >> 0x1F == 0x00)
						goto l23070AE8;
				}
				else if (a7_4 == (struct Eq_84 *) 2 && a1 >> 0x1F != 0x00)
					goto l23070AE8;
				a5_100.u0 = -1;
				a6_112 = 0x00FE;
			}
l23070AE8:
			a2_105 |= 5;
			goto l230708E4;
		}
		a5_100 = (word32) (a5_100 != 0x00);
	}
	if (a5_100 == 0x00)
	{
		a6_112 = 0;
		a2_105.u0 = 0;
		goto l230708C4;
	}
	goto l2307096C;
}

// 23070AF0: Register Eq_2 atoi(Register Eq_2 a0, Register out ptr32 a1Out, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out Eq_6606 a4Out, Register out ptr32 a5Out)
// Called from:
//      aws_main_entry
//      cmd_wifi_cfg
//      cmd_wifi_ap_start
//      cmd_wifi_ap_conf_max_sta
//      wifi_rc_fixed_enable
//      wifi_capcode_cmd
//      cmd_gpio_get
//      cmd_gpio_set
//      cmd_gpio_func
//      cmd_wdt_init
//      httpc_tcp_recv
//      lwip_getaddrinfo
//      netif_find
//      TCP_Server
//      ping_cmd
Eq_2 atoi(Eq_2 a0, ptr32 & a1Out, ptr32 & a2Out, ptr32 & a3Out, union Eq_6606 & a4Out, ptr32 & a5Out)
{
	ptr32 a1_7;
	ptr32 a2_8;
	ptr32 a3_9;
	Eq_6606 a4_10;
	ptr32 a5_11;
	Eq_2 a0_6 = strtol(a0, null, 0x0A, out a1_7, out a2_8, out a3_9, out a4_10, out a5_11);
	a1Out = a1_7;
	a2Out = a2_8;
	a3Out = a3_9;
	a4Out = a4_10;
	a5Out = a5_11;
	return a0_6;
}

