pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0007.c
// 23070AFC: void _atoi_r(Register (ptr32 Eq_2) a0, Register Eq_2 a1)
void _atoi_r(union Eq_2 * a0, Eq_2 a1)
{
	_strtol_r(a0, a1, null, 0x0A);
}

// 23070B08: Register (ptr32 Eq_2) __errno(Register out ptr32 a5Out)
// Called from:
//      aos_loop_run
//      _stat
union Eq_2 * __errno(ptr32 & a5Out)
{
	union Eq_2 * a0_6 = g_ptr4200D994;
	a5Out = 0x4200D994;
	return a0_6;
}

// 23070B18: Register Eq_2 memchr(Register Eq_2 a0, Register int32 a1, Register Eq_2 a2, Register out Eq_127893 a3Out, Register out Eq_2 a5Out)
// Called from:
//      fdt_get_string
//      fdt_subnode_offset_namelen
//      tc_blfdtdump
Eq_2 memchr(Eq_2 a0, int32 a1, Eq_2 a2, union Eq_127893 & a3Out, union Eq_2 & a5Out)
{
	Eq_2 a5_100;
	if ((a0 & 3) != 0x00)
	{
		a5_100 = (word32) a2 - 1;
		if (a2 != 0x00)
		{
			if ((word32) *a0.u0 != (a1 & 0x00FF))
			{
				a3.u0 = -1;
				do
				{
					a0 = (word16) a0.u0 + 1;
					if ((a0 & 3) == 0x00)
						goto l23070B58;
					a5_100 = (word32) a5_100 - 1;
					if (a5_100 == -1)
						goto l23070B84;
				} while ((word32) *a0 != (a1 & 0x00FF));
			}
			goto l23070B88;
		}
	}
	else
	{
		a5_100 = a2;
l23070B58:
		if (a5_100 > 3)
		{
			ui32 a1_31 = a1 << 0x08 & 0xFFFF | a1 & 0x00FF;
			ui32 a7_33 = a1_31 << 0x10 | a1_31;
			do
			{
				ui32 a4_43 = a7_33 ^ *a0;
				a3 = a4_43 + ~0x01010100;
				if ((a4_43 + ~0x01010100 & ~a4_43 & 0x80808080) != 0x00)
					goto l23070B64;
				a5_100 = (word32) a5_100 - 4;
				a0 = (word32) a0 + 4;
			} while (a5_100 > 3);
		}
		if (a5_100 != 0x00)
		{
l23070B64:
			if ((word32) *a0 != (a1 & 0x00FF))
			{
				a5_100 = a0 + a5_100;
				do
				{
					a0 = (word32) a0 + 1;
					if (a5_100 == a0)
						goto l23070B84;
				} while ((word32) *a0 != (a1 & 0x00FF));
			}
l23070B88:
			a3Out = a3;
			a5Out = a5_100;
			return a0;
		}
	}
l23070B84:
	a0.u0 = 0;
	goto l23070B88;
}

// 23070BF4: Register Eq_2 memcmp(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register out Eq_2 a1Out, Register out Eq_2 a2Out, Register out (ptr32 Eq_32722) a3Out, Register out (ptr32 Eq_32722) a4Out, Register out Eq_32724 a5Out)
// Called from:
//      rxu_cntrl_frame_handle
//      scanu_search_by_ssid
//      scanu_rm_exist_ssid
//      _aid_list_delete
//      apm_probe_req_handler
//      apm_assoc_req_handler
//      process_rsn_ie
//      process_wpa_ie
//      IsEAPOL_MICValid
//      parseKeyKDE
//      KeyMgmtSta_IsRxEAPOLValid
//      supplicantAkmIsWpaWpa2
//      supplicantAkmIsWpa2
//      supplicantConstructContext
//      pmkCacheFindPSKElement
//      chan_ctxt_add
//      rxu_mgt_ind_handler
//      bl_utils_idx_lookup
//      stateGlobalGuard_scan_beacon
//      fdt_subnode_offset_namelen
//      fdt_get_property_namelen_
//      ota_tcp_cmd
//      ls_cmd
//      psm_test_cmd
//      vfs_uart_init
//      hal_gpio_init_from_dts
//      ethernet_input
//      dhcp_server_recv
//      file_info
//      dirent_file
//      romfs_register
//      mbedtls_rsa_rsassa_pss_verify_ext
//      mbedtls_rsa_pkcs1_verify
//      mbedtls_ssl_prepare_handshake_record
//      mbedtls_ssl_parse_certificate
//      x509_name_cmp
//      x509_crt_check_parent
//      x509_crt_verify_top.isra.7
//      mbedtls_x509_crt_check_extended_key_usage
//      mbedtls_x509_crt_verify_with_profile
//      mbedtls_x509_crt_parse_der
//      oid_sig_alg_from_asn1.part.0
//      mbedtls_oid_get_attr_short_name
//      mbedtls_oid_get_x509_ext_type
//      mbedtls_oid_get_extended_key_usage
//      mbedtls_oid_get_pk_alg
//      mbedtls_oid_get_ec_grp
//      mbedtls_oid_get_md_alg
//      mbedtls_pem_read_buffer
//      mbedtls_ssl_handshake_server_step
//      two_way_long_needle
//      strstr
Eq_2 memcmp(Eq_2 a0, Eq_2 a1, Eq_2 a2, union Eq_2 & a1Out, union Eq_2 & a2Out, struct Eq_32722 & a3Out, struct Eq_32722 & a4Out, union Eq_32724 & a5Out)
{
	Eq_32724 a5_17;
	if (a2 > 3)
	{
		a3 = (struct Eq_32722 *) 3;
		if (((a0 | a1) & 3) != 0x00)
		{
l23070C6C:
			a5_17 = (word32) a2 - 1;
l23070C30:
			a4 = (word32) *a0;
			a3 = (word32) *a1;
			if (a4 == a3)
			{
				a4 = (word32) a5_17 + 1;
				a5_17 = (word32) a0 + 1;
				word32 a0_39 = a0 + a4;
				do
				{
					a1 = (word32) a1 + 1;
					if (a5_17 == a0_39)
						goto l23070C64;
					a4 = (word32) *a5_17;
					a3 = (word32) *a1;
					a5_17 = (word32) a5_17 + 1;
				} while (a4 == a3);
			}
			a1Out = a1;
			a2Out = a2;
			a3Out = a3;
			a4Out = a4;
			a5Out = a5_17;
			return a4 - a3;
		}
		do
		{
			a4 = (struct Eq_32722 *) *a0;
			if (a4 != *a1)
				goto l23070C6C;
			a2 = (word32) a2 - 4;
			a0 = (word32) a0 + 4;
			a1 = (word32) a1 + 4;
		} while (a2 > 3);
	}
	a5_17 = (word32) a2 - 1;
	if (a2 == 0x00)
	{
l23070C64:
		a1Out = a1;
		a2Out = a2;
		a3Out = a3;
		a4Out = a4;
		a5Out = a5_17;
		return 0;
	}
	goto l23070C30;
}

// 23070C7C: Register int32 memcpy(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register out Eq_2 a1Out, Register out Eq_2 a2Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out Eq_1732 a6Out, Register out Eq_2 a7Out)
// Called from:
//      http_test_cmd
//      aws_main_entry
//      mm_sta_add
//      mm_bcn_change
//      ps_send_pspoll
//      scan_probe_req_tx
//      sta_mgmt_register
//      txl_frame_get
//      txl_frame_send_null_frame
//      txl_frame_send_qosnull_frame
//      txl_frame_send_eapol_frame
//      vif_mgmt_register
//      rc_update_stats
//      rc_init
//      rxu_cntrl_frame_handle
//      scanu_scan_next
//      scanu_start
//      sm_scan_bss
//      sm_join_bss
//      sm_set_bss_param
//      sm_disconnect
//      sm_connect_ind
//      sm_auth_send
//      sm_assoc_req_send
//      sm_handle_supplicant_result
//      txu_cntrl_sechdr_len_compute
//      apm_start_cfm
//      apm_set_bss_param
//      apm_sta_add
//      apm_send_mlme
//      apm_bcn_set
//      apm_assoc_req_handler
//      keyMgmtSta_StartSession
//      supplicantInitSession
//      supplicantEnable
//      keyMgmtFormatWpaRsnIe
//      add_key_to_mac
//      add_mfp_key_to_mac
//      keyMgmtPlumbPairwiseKey
//      process_rsn_ie
//      process_wpa_ie
//      isApReplayCounterFresh
//      updateApReplayCounter
//      formEAPOLEthHdr
//      IsEAPOL_MICValid
//      parseKeyDataGTK
//      KeyMgmtSta_PrepareEAPOLFrame
//      supplicantConstructContext
//      KeyMgmtSta_DeriveKeys
//      GetKeyMsgNonceFromEAPOL
//      ProcessRxEAPOL_GrpMsg1
//      bl_sha256_crypto_kdf
//      pmkCacheSetPassphrase
//      pmkCacheAddPSK
//      RC4_Encrypt
//      sha256_compress
//      sha256_vector
//      hmac_sha256_vector
//      ProcessKeyMgmtDataAp
//      GenerateGTK_internal
//      PopulateKeyMsg
//      prepareKDE
//      Encrypt_keyData
//      KeyMgmtAp_DerivePTK
//      KeyData_CopyWPAWP2
//      InitKeyMgmtInfo
//      cm_InitConnection
//      cm_SetPeerAddr
//      cm_SetComData
//      trpc_power_get
//      rf_pri_update_tx_power_offset
//      mm_hw_config_handler
//      me_build_beacon
//      me_rc_stats_req_handler
//      me_chan_config_req_handler
//      me_config_req_handler
//      me_sta_add_req_handler
//      scanu_raw_send_req_handler
//      rxu_mgt_ind_handler
//      scanu_join_cfm_handler
//      sm_connect_req_handler
//      mm_sta_add_cfm_handler
//      apm_start_req_handler
//      Bl_hmac_md5
//      Bl_hmac_sha1
//      Bl_PRF
//      wpa_MD5Update
//      wpa_MD5Final
//      ap_setpsk
//      InitializeAp
//      ipc_host_init
//      bl_main_apm_sta_info_get
//      bl_send_start
//      bl_send_add_if
//      bl_send_sm_connect_req
//      bl_send_apm_start_req
//      bl_rx_apm_sta_add_ind
//      bl_rx_scanu_result_ind
//      bl_output
//      stateGlobalGuard_scan_beacon
//      wifi_mgmr_ap_sta_info_get_internal
//      wifi_mgmr_api_scan_item_beacon
//      wifi_mgmr_api_ap_start
//      cmd_wifi_power_table_update
//      wifi_mgmr_sta_enable
//      wifi_mgmr_sta_ssid_set
//      wifi_mgmr_sta_psk_set
//      wifi_mgmr_sta_connect
//      wifi_mgmr_ap_enable
//      wifi_mgmr_ap_sta_info_get
//      wifi_mgmr_cfg_req
//      wifi_mgmr_profile_add
//      wifi_mgmr_profile_get
//      cmd_mgr_msgind
//      tc_fdt_wifi_module
//      ota_tcp_cmd
//      cli_main_input
//      psm_test_cmd
//      prvCopyDataToQueue
//      prvCopyDataFromQueue
//      prvWriteBytesToBuffer
//      prvReadBytesFromBuffer
//      bl_uart_init
//      bl_chip_info
//      bl_rand_stream
//      bl_wifi_sta_mac_addr_set
//      bl_wifi_ap_mac_addr_set
//      bl_wifi_mac_addr_get
//      bl_wifi_ap_info_set
//      bl_wifi_sta_info_set
//      bl_wifi_sta_info_get
//      cmd_timer_start
//      vfs_uart_init
//      hal_uart_setconfig
//      hal_board_cfg
//      bl_tsen_adc_get
//      PtTable_Update_Entry
//      PtTable_Get_Active_Entries
//      lwip_getaddrinfo
//      lwip_sock_make_addr.isra.3
//      lwip_accept
//      lwip_sendto
//      dns_gethostbyname
//      lwip_chksum_copy
//      etharp_input
//      etharp_request
//      ip4_output_if_opt
//      pbuf_copy
//      pbuf_copy_partial
//      pbuf_take
//      pbuf_take_at
//      tcp_seg_copy
//      ethernet_output
//      icmp_input
//      icmp_dest_unreach
//      dhcp_client_find_by_ip.isra.0
//      dhcp_server_recv
//      dhcpd_start
//      ping_recv
//      romfs_read
//      dirent_file
//      utils_sha256_update
//      Bl_F_fast.constprop.0
//      utils_wifi_psk_cal_fast_bin
//      utils_hmac_sha1_fast
//      inode_reserve
//      aos_poll_read_fd
//      event_write
//      event_read
//      aws_iot_shadow_init
//      aws_iot_shadow_connect
//      isJsonKeyMatchingAndUpdateValue
//      shadow_delta_callback
//      AckStatusCallback
//      addToAckWaitList
//      aws_iot_mqtt_init
//      aws_iot_mqtt_publish
//      aws_iot_mqtt_internal_write_utf8_string
//      mfg_media_read_macaddr
//      Bl_F
//      bl60x_fw_password_hash
//      bl_mtd_write
//      block_cipher_df
//      ctr_drbg_update_internal
//      mbedtls_ctr_drbg_reseed
//      mbedtls_ctr_drbg_random
//      mbedtls_entropy_func
//      mbedtls_rsa_rsaes_oaep_encrypt
//      mbedtls_rsa_pkcs1_encrypt
//      mbedtls_rsa_rsaes_oaep_decrypt
//      mbedtls_rsa_pkcs1_decrypt
//      mbedtls_rsa_pkcs1_sign
//      ssl_swap_epochs
//      tls_prf_sha256
//      mbedtls_ssl_derive_keys
//      mbedtls_ssl_set_hostname
//      mbedtls_ssl_write_record
//      mbedtls_ssl_resend
//      mbedtls_ssl_prepare_handshake_record
//      mbedtls_ssl_write_certificate
//      mbedtls_ssl_write_finished
//      mbedtls_ssl_write
//      mbedtls_ssl_read_record_layer
//      mbedtls_ssl_read
//      mbedtls_x509_crt_parse_der
//      mbedtls_aes_crypt_cbc
//      mbedtls_mpi_grow
//      mbedtls_mpi_shrink
//      mbedtls_mpi_copy
//      mpi_montmul
//      mbedtls_mpi_exp_mod
//      mbedtls_cipher_set_iv
//      mbedtls_cipher_update
//      mbedtls_cipher_auth_encrypt
//      mbedtls_debug_print_crt
//      ecp_mod_p256k1
//      mbedtls_gcm_starts
//      sha224_clone_wrap
//      sha224_update_wrap
//      pem_aes_decrypt
//      mbedtls_md5_clone
//      mbedtls_md5_update
//      mbedtls_sha1_clone
//      mbedtls_sha1_update
//      mbedtls_ssl_handshake_client_step
//      mbedtls_ssl_handshake_server_step
int32 memcpy(Eq_2 a0, Eq_2 a1, Eq_2 a2, union Eq_2 & a1Out, union Eq_2 & a2Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_2 & a5Out, union Eq_1732 & a6Out, union Eq_2 & a7Out)
{
	Eq_2 a4_11;
	ui32 a5_5 = a1 ^ a0;
	Eq_2 a5_118 = a5_5 & 3;
	word32 a7_8 = a0 + a2;
	if ((a5_5 & 3) == 0x00)
	{
		a5_118.u0 = 3;
		if (a2 > 3)
		{
			a4_11 = (word32) a0 + 1;
			if ((a0 & 3) != 0x00)
			{
				do
				{
					a3 = (word32) *a1;
					a4_11 = a4_11;
					((word32) a4_11 + 0x0FFF)->u1 = (byte) a3;
					a1 = (word32) a1 + 1;
					if ((a4_11 & 3) == 0x00)
						break;
					a3 = (word32) *a1;
					((word32) a4_11 + 0x00001000)->u1 = (byte) a3;
					++a4_11;
					a1 = (word32) a1 + 1;
				} while ((a4_11 + 1 & 3) != 0x00);
			}
			a2 = a7_8 & -4;
			a5_118 = (a7_8 & -4) + -32;
			while (a4_11 < a5_118)
			{
				int32 t0_36 = *((word32) a1 + 4);
				int32 t6_37 = *((word32) a1 + 8);
				int32 t5_38 = *((word32) a1 + 0x0C);
				int32 t4_39 = *((word32) a1 + 16);
				int32 t3_40 = *((word32) a1 + 20);
				t1 = (int32) *((word32) a1 + 24);
				a6 = *((word32) a1 + 28);
				*a4_11 = *a1;
				a1 = (word32) a1 + 36;
				a3 = *((word32) a1 - 4);
				*((word32) a4_11 + 4) = t0_36;
				*((word32) a4_11 + 8) = t6_37;
				*((word32) a4_11 + 0x0C) = t5_38;
				*((word32) a4_11 + 16) = t4_39;
				*((word32) a4_11 + 20) = t3_40;
				*((word32) a4_11 + 24) = t1;
				*((word32) a4_11 + 28) = a6;
				a4_11 = (word32) a4_11 + 36;
				*((word32) a4_11 + 0x0FFC) = a3;
			}
			if (a4_11 < (a7_8 & -4))
			{
				a3 = a1;
				Eq_2 a5_63 = a4_11;
				do
				{
					a6 = *a3;
					a5_63 = (word32) a5_63 + 4;
					*((word32) a5_63 + 0x0FFC) = a6;
					a3 = (word32) a3 + 4;
				} while (a5_63 < (a7_8 & -4));
				a5_118 = ((a7_8 & -4) + -1 - a4_11 & -4) + 4;
				a4_11 += a5_118;
				a1 += a5_118;
			}
			if (a4_11 >= a7_8)
			{
l23070CE8:
				a1Out = a1;
				a2Out = a2;
				a3Out = a3;
				a4Out = a4_11;
				a5Out = a5_118;
				a6Out = a6;
				a7Out.u0 = <invalid>;
				return t1;
			}
l23070CF4:
			do
			{
				Eq_2 a5_87 = (word32) *a1;
				a4_11 = (word32) a4_11 + 1;
				((word32) a4_11 + 0x0FFF)->u1 = (byte) a5_87;
				a1 = (word32) a1 + 1;
			} while (a4_11 < a7_8);
			a1Out = a1;
			a2Out = a2;
			a3Out = a3;
			a4Out = a4_11;
			a5Out = a5_87;
			a6Out = a6;
			a7Out.u0 = <invalid>;
			return t1;
		}
	}
	a4_11 = a0;
	if (a0 >= a7_8)
		goto l23070CE8;
	goto l23070CF4;
}

// 23070D98: Register Eq_2 memmove(Register Eq_2 a0, Register Eq_2 a1, Register (ptr32 Eq_28011) a2, Register out Eq_2 a3Out, Register out (ptr32 byte) a4Out, Register out Eq_2 a5Out)
// Called from:
//      rc_sort_samples_tp
//      mbedtls_ssl_write_record
//      mbedtls_ssl_fetch_input
//      mbedtls_ssl_prepare_handshake_record
//      mbedtls_ssl_read_record_layer
Eq_2 memmove(Eq_2 a0, Eq_2 a1, struct Eq_28011 * a2, union Eq_2 & a3Out, byte & a4Out, union Eq_2 & a5Out)
{
	if (a1 < a0)
	{
		word32 a5_6 = a1 + a2;
		if (a0 < a5_6)
		{
			word32 a4_81 = a0 + a2;
			if (a2 == null)
			{
				a3Out = a3;
				a4Out = a4_81;
				a5Out = a5_6;
				return a1;
			}
			else
			{
				do
				{
					a5_6 = (word32) a5_6 - 1;
					Eq_2 a3_85 = (word32) *a5_6;
					a4_81 += -1;
					*a4_81 = (byte) a3_85;
				} while (a1 != a5_6);
				a3Out = a3_85;
				a4Out = a4_81;
				a5Out = a5_6;
				return a1;
			}
		}
	}
	Eq_2 a5_14;
	Eq_2 a3_13;
	if (a2 <= (struct Eq_28011 *) 0x0F)
		a5_14 = a0;
	else
	{
		if (((a1 | a0) & 3) != 0x00)
		{
			a3_13 = (char *) a2 - 1;
			a5_14 = a0;
			goto l23070DD8;
		}
		ui32 a7_16 = (char *) a2 - 16 & -16;
		Eq_2 a6_18 = (word32) a0 + (a7_16 + 16);
		Eq_2 a4_19 = a1;
		a5_14 = a0;
		do
		{
			a5_14 = (word32) a5_14 + 16;
			*((word32) a5_14 + 0x0FF0) = *a4_19;
			a4_19 = (word32) a4_19 + 16;
			*((word32) a5_14 + 0x0FF4) = *((word32) a4_19 - 0x0C);
			*((word32) a5_14 + 0x0FF8) = *((word32) a4_19 - 8);
			*((word32) a5_14 + 0x0FFC) = *((word32) a4_19 - 4);
		} while (a6_18 != a5_14);
		a4 = a2 & 0x0C;
		a1 = (word32) a1 + (a7_16 + 16);
		if ((a2 & 0x0C) != 0x00)
		{
			Eq_2 a4_42 = a1;
			Eq_2 a7_43 = a5_14;
			do
			{
				a4_42 = (word32) a4_42 + 4;
				a7_43 = (word32) a7_43 + 4;
				*((word32) a7_43 + 0x0FFC) = *((word32) a4_42 - 4);
			} while ((word32) a1 + ((a2 & 0x0F) - a4_42) > 3);
			a4 = ((a2 & 0x0F) + -4 & -4) + 4;
			a2 &= 3;
			a5_14 += a4;
			a1 += a4;
		}
		else
			a2 &= 0x0F;
	}
	a3_13 = (char *) a2 - 1;
	if (a2 == null)
	{
		a3Out = a3_13;
		a4Out = a4;
		a5Out = a5_14;
		return a1;
	}
l23070DD8:
	Eq_2 a3_72 = (word32) a5_14 + ((word32) a3_13 + 1);
	do
	{
		a1 = (word32) a1 + 1;
		byte * a4_76 = (word32) *((word32) a1 - 1);
		a5_14 = (word32) a5_14 + 1;
		((word32) a5_14 + 0x0FFF)->u1 = (byte) a4_76;
	} while (a5_14 != a3_72);
	a3Out = a3_72;
	a4Out = a4_76;
	a5Out = a5_14;
	return a1;
}

