pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0007.c
// 23070EB8: Register Eq_2 memset(Register Eq_2 ra, Register Eq_2 a0, Register Eq_1196 a1, Register Eq_2 a2, Register out Eq_2 t1Out, Register out Eq_2 a0Out, Register out Eq_1196 a1Out, Register out Eq_2 a2Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out (ptr32 Eq_1204) a5Out)
// Called from:
//      cmd_httpc_test
//      http_test_cmd
//      event_cb_wifi_event
//      mm_env_init
//      mm_init
//      mm_sta_add
//      mm_sta_del
//      mm_bcn_init_vif
//      ps_init
//      scan_init
//      sta_mgmt_entry_init
//      sta_mgmt_add_key
//      td_reset
//      txl_cntrl_init
//      txl_reset
//      txl_frame_init_desc
//      txl_frame_init
//      vif_mgmt_init
//      vif_mgmt_unregister
//      vif_mgmt_add_key
//      me_init
//      rc_update_stats
//      rc_init
//      rxu_swdesc_upload_evt
//      scanu_init
//      scanu_rm_exist_ssid
//      _aid_list_delete
//      apm_init
//      apm_assoc_req_handler
//      ke_msg_alloc
//      GetTxEAPOLBuffer
//      init_customApp_mibs
//      supplicantInit
//      add_key_to_mac
//      add_mfp_key_to_mac
//      IsEAPOL_MICValid
//      KeyMgmtSta_PrepareEAPOLFrame
//      set_psk
//      pmkCacheInit
//      pmkCacheNewElement
//      pmkCacheDeletePSK
//      hmac_sha256_vector
//      PrepDefaultEapolMsg
//      InitStaKeyInfo
//      prepareKDE
//      cm_InitConnection
//      ipc_emb_init
//      ipc_emb_tx_evt
//      phy_tcal_reset
//      chan_init
//      chan_ctxt_del
//      mm_monitor_enable_req_handler
//      bl_init
//      txl_cfm_init
//      me_build_associate_req
//      me_build_beacon
//      me_build_probe_rsp
//      me_build_associate_rsp
//      rxu_mgt_ind_handler
//      dbg_init
//      generate_subkey
//      bl_aes_cmac
//      Bl_hmac_md5
//      Bl_hmac_sha1
//      Bl_PRF
//      wpa_MD5Transform
//      wpa_MD5Final
//      Bl_SHA1Final
//      InitializeAp
//      ipc_host_init
//      bl_main_monitor
//      bl_main_apm_start
//      bl_main_apm_sta_delete
//      bl_main_connect
//      bl_send_msg
//      bl_msg_zalloc.constprop.3
//      notify_event_scan_done
//      bl_rx_chan_switch_ind
//      bl_rx_sm_connect_ind
//      bl_rx_sm_disconnect_ind
//      bl_rx_scanu_result_ind
//      bl_output
//      tcpip_stack_input
//      bl_ipc_init
//      stateGlobalGuard_scan_beacon
//      wifi_mgmr_ap_sta_info_get_internal
//      wifi_mgmr_api_ip_update
//      wifi_mgmr_api_reconnect
//      wifi_mgmr_api_disable_autoreconnect
//      wifi_mgmr_api_enable_autoreconnect
//      wifi_mgmr_api_disconnect
//      wifi_mgmr_api_ifaceup
//      wifi_mgmr_api_sniffer_enable
//      wifi_mgmr_api_scan_item_beacon
//      wifi_mgmr_api_fw_disconnect
//      wifi_mgmr_api_fw_tsen_reload
//      wifi_mgmr_api_fw_scan
//      wifi_mgmr_api_fw_powersaving
//      wifi_mgmr_api_ap_start
//      wifi_mgmr_api_ap_stop
//      wifi_mgmr_api_idle
//      wifi_mgmr_api_raw_send
//      wifi_ap_sta_list_get_cmd
//      wifi_ap_sta_delete_cmd
//      cmd_wifi_ap_start
//      wifi_denoise_disable_cmd
//      wifi_denoise_enable_cmd
//      wifi_mgmr_sta_connect
//      wifi_mgmr_ap_sta_info_get
//      wifi_mgmr_rate_config
//      wifi_mgmr_conf_max_sta
//      wifi_mgmr_cfg_req
//      wifi_mgmr_profile_add
//      wifi_mgmr_profile_get
//      cb_disconnect_ind
//      cb_connect_ind
//      netif_status_callback
//      bl606a0_wifi_init
//      cmd_blog_info_dump
//      ota_tcp_cmd
//      hexdump_cmd
//      aos_cli_init
//      aos_cli_printf
//      proc_onecmd
//      ls_cmd
//      cli_getchar
//      cli_main_input
//      get_dns_request
//      dns_server_init
//      write_status
//      format_sector.constprop.16
//      move_env
//      create_env_blob
//      ef_port_init
//      psm_test_cmd
//      prvInitialiseNewStreamBuffer
//      vStreamBufferDelete
//      prvInitialiseNewTask.isra.2
//      bl_cks_test
//      bl_dma_test
//      Sec_Eng_AES_Link_Case_CBC_128
//      Sec_Eng_AES_Link_Case_CTR_128
//      Sec_Eng_AES_Link_Case_ECB_128
//      sha256_test_case0
//      bl_wifi_ap_info_set
//      bl_wifi_sta_info_set
//      dev_uart_init
//      hal_gpio_init_from_dts
//      hal_board_cfg
//      httpc_tcp_recv
//      httpc_init_connection_common.constprop.5
//      loopset_led_trigger
//      lwip_getaddrinfo
//      lwip_sock_make_addr.isra.3
//      lwip_accept
//      lwip_select
//      altcp_alloc
//      dns_check_entry
//      dhcp_create_msg
//      dhcp_recv
//      dhcp_start
//      ip4_output_if_opt
//      netif_add
//      raw_new
//      stats_netstat
//      tcp_new_ip_type
//      udp_new_ip_type
//      dhcp_server_recv
//      dhcp_server_start
//      tcpc_entry
//      TCP_Server
//      iperf_server_udp
//      iperf_server_udp_recv_fn
//      iperf_client_udp
//      iperf_server
//      iperf_client_tcp
//      dirent_file
//      romfs_opendir
//      romfs_register
//      sntp_dns_found
//      utils_sha256_init
//      utils_hmac_sha1_fast
//      inode_init
//      aos_register_driver
//      aos_register_fs
//      aos_loop_init
//      aos_task_new
//      event_open
//      Sec_Eng_SHA256_Init
//      Sec_Eng_SHA256_Link_Init
//      mfg_media_read_poweroffset
//      bl_mtd_open
//      bloop_init
//      bloop_timer_init
//      block_cipher_df
//      ctr_drbg_update_internal
//      mbedtls_ctr_drbg_init
//      mbedtls_ctr_drbg_reseed
//      mbedtls_ctr_drbg_seed
//      mbedtls_ctr_drbg_random
//      mbedtls_entropy_init
//      mbedtls_entropy_func
//      pk_get_pk_alg
//      mgf_mask
//      mbedtls_rsa_init
//      mbedtls_rsa_rsaes_oaep_encrypt
//      mbedtls_rsa_pkcs1_sign
//      mbedtls_rsa_rsassa_pss_verify_ext
//      mbedtls_sha256_init
//      mbedtls_ssl_session_init
//      mbedtls_ssl_init
//      mbedtls_ssl_setup
//      mbedtls_ssl_config_init
//      mbedtls_ssl_write_record
//      mbedtls_ssl_prepare_handshake_record
//      mbedtls_ssl_write_finished
//      mbedtls_ssl_parse_change_cipher_spec
//      mbedtls_x509_crt_init
//      mbedtls_x509_crt_parse_der
//      mbedtls_net_connect
//      mycalloc
//      mbedtls_aes_init
//      mbedtls_mpi_copy
//      mbedtls_mpi_lset
//      mbedtls_mpi_write_binary
//      mpi_montmul
//      mbedtls_mpi_exp_mod
//      mbedtls_cipher_init
//      mbedtls_cipher_setup
//      mbedtls_cipher_auth_encrypt
//      mbedtls_debug_print_buf
//      mbedtls_debug_print_crt
//      mbedtls_ecp_group_init
//      mbedtls_ecp_mul
//      mbedtls_ecp_check_pub_priv
//      ecp_mod_p256k1
//      mbedtls_gcm_init
//      mbedtls_gcm_setkey
//      mbedtls_gcm_starts
//      mbedtls_md_init
//      mbedtls_md_hmac_starts
//      mbedtls_pem_init
//      mbedtls_pem_read_buffer
//      mbedtls_md5_init
//      mbedtls_sha1_init
//      mbedtls_ssl_handshake_server_step
//      mbedtls_x509_dn_gets
//      strstr
Eq_2 memset(Eq_2 ra, Eq_2 a0, Eq_1196 a1, Eq_2 a2, union Eq_2 & t1Out, union Eq_2 & a0Out, union Eq_1196 & a1Out, union Eq_2 & a2Out, union Eq_2 & a3Out, union Eq_2 & a4Out, struct Eq_1204 & a5Out)
{
	Eq_2 t1_14 = 0x0F;
	Eq_2 a4_25 = a0;
	if (a2 > 0x0F)
	{
		struct Eq_1204 * a5_24 = a0 & 0x0F;
		if ((a0 & 0x0F) != 0x00)
		{
			Eq_359836 a3_10 = ((a0 & 0x0F) << 0x02) + 587665260;
			word32 a4_16;
			word32 a2_17;
			word32 a5_18;
			Eq_2 t0_22;
			(*((word32) a3_10 - 96))();
			ra = t0_22;
			a5_24 = a5_18 + -16;
			a4_25 = a4_16 - (a5_18 + -16);
			a2 = a2_17 + (a5_18 + -16);
			if (t1_14 >= a2)
				goto l23070EFC;
		}
		if (a1 != 0x00)
		{
			ui32 a1_29 = a1 & 0x00FF;
			ui32 a1_31 = a1_29 | a1_29 << 0x08;
			a1 = a1_31 | a1_31 << 0x10;
		}
		a2 &= 0x0F;
		Eq_2 a3_40 = (word32) a4_25 + (a2 & -16);
		do
		{
			*a4_25 = a1;
			*((word32) a4_25 + 4) = a1;
			*((word32) a4_25 + 8) = a1;
			*((word32) a4_25 + 0x0C) = a1;
			a4_25 = (word32) a4_25 + 16;
		} while (a4_25 < a3_40);
		if (a2 == 0x00)
		{
			t1Out = t1_14;
			a0Out = a0;
			a1Out = a1;
			a2Out = a2;
			a3Out = a3_40;
			a4Out = a4_25;
			a5Out = a5_24;
			return ra;
		}
	}
l23070EFC:
	Eq_359814 a3_58 = (t1_14 - a2 << 0x02) + 587665156;
	Eq_2 t1_73;
	Eq_2 a0_74;
	Eq_2 a4_75;
	Eq_2 a2_76;
	struct Eq_1204 * a5_77;
	Eq_1196 a1_78;
	Eq_2 a3_79;
	Eq_2 ra_80;
	(*((word32) a3_58 + 0x0C))();
	t1Out = t1_73;
	a0Out = a0_74;
	a1Out = a1_78;
	a2Out = a2_76;
	a3Out = a3_79;
	a4Out = a4_75;
	a5Out = a5_77;
	return ra_80;
}

// 23070F0C: void fn23070F0C(Register ptr32 a3)
// Called from:
//      memset
void fn23070F0C(ptr32 a3)
{
	(a3 + 0x0C)();
}

