pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0007.c
// 23070F10: void fn23070F10(Register word32 a1, Register (ptr32 Eq_359894) a4)
// Called from:
//      memset
void fn23070F10(word32 a1, struct Eq_359894 * a4)
{
	a4->b000E = (byte) a1;
	a4->b000D = (byte) a1;
	a4->b000C = (byte) a1;
	a4->b000B = (byte) a1;
	a4->b000A = (byte) a1;
	a4->b0009 = (byte) a1;
	a4->b0008 = (byte) a1;
	a4->b0007 = (byte) a1;
	a4->b0006 = (byte) a1;
	a4->b0005 = (byte) a1;
	a4->b0004 = (byte) a1;
	a4->b0003 = (byte) a1;
	a4->b0002 = (byte) a1;
	a4->b0001 = (byte) a1;
	a4->b0000 = (byte) a1;
}

// 23070F14: void fn23070F14(Register word32 a1, Register (ptr32 Eq_359956) a4)
// Called from:
//      memset
void fn23070F14(word32 a1, struct Eq_359956 * a4)
{
	a4->b000D = (byte) a1;
	a4->b000C = (byte) a1;
	a4->b000B = (byte) a1;
	a4->b000A = (byte) a1;
	a4->b0009 = (byte) a1;
	a4->b0008 = (byte) a1;
	a4->b0007 = (byte) a1;
	a4->b0006 = (byte) a1;
	a4->b0005 = (byte) a1;
	a4->b0004 = (byte) a1;
	a4->b0003 = (byte) a1;
	a4->b0002 = (byte) a1;
	a4->b0001 = (byte) a1;
	a4->b0000 = (byte) a1;
}

// 23070F18: void fn23070F18(Register word32 a1, Register (ptr32 Eq_360014) a4)
// Called from:
//      memset
void fn23070F18(word32 a1, struct Eq_360014 * a4)
{
	a4->b000C = (byte) a1;
	a4->b000B = (byte) a1;
	a4->b000A = (byte) a1;
	a4->b0009 = (byte) a1;
	a4->b0008 = (byte) a1;
	a4->b0007 = (byte) a1;
	a4->b0006 = (byte) a1;
	a4->b0005 = (byte) a1;
	a4->b0004 = (byte) a1;
	a4->b0003 = (byte) a1;
	a4->b0002 = (byte) a1;
	a4->b0001 = (byte) a1;
	a4->b0000 = (byte) a1;
}

// 23070F1C: void fn23070F1C(Register word32 a1, Register (ptr32 Eq_360068) a4)
// Called from:
//      memset
void fn23070F1C(word32 a1, struct Eq_360068 * a4)
{
	a4->b000B = (byte) a1;
	a4->b000A = (byte) a1;
	a4->b0009 = (byte) a1;
	a4->b0008 = (byte) a1;
	a4->b0007 = (byte) a1;
	a4->b0006 = (byte) a1;
	a4->b0005 = (byte) a1;
	a4->b0004 = (byte) a1;
	a4->b0003 = (byte) a1;
	a4->b0002 = (byte) a1;
	a4->b0001 = (byte) a1;
	a4->b0000 = (byte) a1;
}

// 23070F20: void fn23070F20(Register word32 a1, Register (ptr32 Eq_360118) a4)
// Called from:
//      memset
void fn23070F20(word32 a1, struct Eq_360118 * a4)
{
	a4->b000A = (byte) a1;
	a4->b0009 = (byte) a1;
	a4->b0008 = (byte) a1;
	a4->b0007 = (byte) a1;
	a4->b0006 = (byte) a1;
	a4->b0005 = (byte) a1;
	a4->b0004 = (byte) a1;
	a4->b0003 = (byte) a1;
	a4->b0002 = (byte) a1;
	a4->b0001 = (byte) a1;
	a4->b0000 = (byte) a1;
}

// 23070F24: void fn23070F24(Register word32 a1, Register (ptr32 Eq_360164) a4)
// Called from:
//      memset
void fn23070F24(word32 a1, struct Eq_360164 * a4)
{
	a4->b0009 = (byte) a1;
	a4->b0008 = (byte) a1;
	a4->b0007 = (byte) a1;
	a4->b0006 = (byte) a1;
	a4->b0005 = (byte) a1;
	a4->b0004 = (byte) a1;
	a4->b0003 = (byte) a1;
	a4->b0002 = (byte) a1;
	a4->b0001 = (byte) a1;
	a4->b0000 = (byte) a1;
}

// 23070F28: void fn23070F28(Register word32 a1, Register (ptr32 Eq_360206) a4)
// Called from:
//      memset
void fn23070F28(word32 a1, struct Eq_360206 * a4)
{
	a4->b0008 = (byte) a1;
	a4->b0007 = (byte) a1;
	a4->b0006 = (byte) a1;
	a4->b0005 = (byte) a1;
	a4->b0004 = (byte) a1;
	a4->b0003 = (byte) a1;
	a4->b0002 = (byte) a1;
	a4->b0001 = (byte) a1;
	a4->b0000 = (byte) a1;
}

// 23070F2C: void fn23070F2C(Register word32 a1, Register (ptr32 Eq_360244) a4)
// Called from:
//      memset
void fn23070F2C(word32 a1, struct Eq_360244 * a4)
{
	a4->b0007 = (byte) a1;
	a4->b0006 = (byte) a1;
	a4->b0005 = (byte) a1;
	a4->b0004 = (byte) a1;
	a4->b0003 = (byte) a1;
	a4->b0002 = (byte) a1;
	a4->b0001 = (byte) a1;
	a4->b0000 = (byte) a1;
}

// 23070F30: void fn23070F30(Register word32 a1, Register (ptr32 Eq_360278) a4)
// Called from:
//      memset
void fn23070F30(word32 a1, struct Eq_360278 * a4)
{
	a4->b0006 = (byte) a1;
	a4->b0005 = (byte) a1;
	a4->b0004 = (byte) a1;
	a4->b0003 = (byte) a1;
	a4->b0002 = (byte) a1;
	a4->b0001 = (byte) a1;
	a4->b0000 = (byte) a1;
}

// 23070F34: void fn23070F34(Register word32 a1, Register (ptr32 Eq_360308) a4)
// Called from:
//      memset
void fn23070F34(word32 a1, struct Eq_360308 * a4)
{
	a4->b0005 = (byte) a1;
	a4->b0004 = (byte) a1;
	a4->b0003 = (byte) a1;
	a4->b0002 = (byte) a1;
	a4->b0001 = (byte) a1;
	a4->b0000 = (byte) a1;
}

// 23070F38: void fn23070F38(Register word32 a1, Register (ptr32 Eq_360334) a4)
// Called from:
//      memset
void fn23070F38(word32 a1, struct Eq_360334 * a4)
{
	a4->b0004 = (byte) a1;
	a4->b0003 = (byte) a1;
	a4->b0002 = (byte) a1;
	a4->b0001 = (byte) a1;
	a4->b0000 = (byte) a1;
}

// 23070F3C: void fn23070F3C(Register word32 a1, Register (ptr32 Eq_360356) a4)
// Called from:
//      memset
void fn23070F3C(word32 a1, struct Eq_360356 * a4)
{
	a4->b0003 = (byte) a1;
	a4->b0002 = (byte) a1;
	a4->b0001 = (byte) a1;
	a4->b0000 = (byte) a1;
}

// 23070F40: void fn23070F40(Register word32 a1, Register (ptr32 Eq_360374) a4)
// Called from:
//      memset
void fn23070F40(word32 a1, struct Eq_360374 * a4)
{
	a4->b0002 = (byte) a1;
	a4->b0001 = (byte) a1;
	a4->b0000 = (byte) a1;
}

// 23070F44: void fn23070F44(Register word32 a1, Register (ptr32 Eq_360388) a4)
// Called from:
//      memset
void fn23070F44(word32 a1, struct Eq_360388 * a4)
{
	a4->b0001 = (byte) a1;
	a4->b0000 = (byte) a1;
}

// 23070F48: void fn23070F48(Register word32 a1, Register (ptr32 byte) a4)
// Called from:
//      memset
void fn23070F48(word32 a1, byte * a4)
{
	*a4 = (byte) a1;
}

// 23070F94: Register Eq_2 strchr(Register Eq_2 a0, Register Eq_2 a1, Register out Eq_2 a1Out, Register out Eq_4069 a2Out, Register out Eq_4070 a3Out, Register out Eq_4071 a4Out, Register out Eq_4072 a5Out)
// Called from:
//      event_cb_wifi_event
//      proc_onecmd
//      dhcpd_start
//      dirent_file
//      strrchr
//      strstr
Eq_2 strchr(Eq_2 a0, Eq_2 a1, union Eq_2 & a1Out, union Eq_4069 & a2Out, union Eq_4070 & a3Out, union Eq_4071 & a4Out, union Eq_4072 & a5Out)
{
	Eq_4072 a5_13;
	Eq_4070 a3_123 = a1 & 0x00FF;
	if ((a1 & 0x00FF) == 0x00)
	{
		if ((a0 & 3) != 0x00)
		{
			Eq_4072 a5_8 = (word32) *a0;
			if (a5_8 == 0x00)
			{
				a1Out = a1;
				a2Out = a2;
				a3Out = a1 & 0x00FF;
				a4Out = a4;
				a5Out = a5_8;
				return a0;
			}
			do
			{
				a0 = (word32) a0 + 1;
				if ((a0 & 3) == 0x00)
					goto l23071098;
				a5_13 = (word32) *a0;
			} while (a5_13 != 0x00);
		}
		else
		{
l23071098:
			Eq_360515 a4_16 = *a0;
			a4 = ~a4_16;
			a2.u0 = ~0x01010100;
			a3_123.u0 = 0x80808080;
			if (((word32) a4_16 - 0x01010101 & a4 & 0x80808080) == 0x00)
			{
				do
				{
					a0 = (word32) a0 + 4;
					Eq_360557 a4_28 = *a0;
					a4 = ~a4_28;
				} while (((word32) a4_28 - 0x01010101 & a4 & 0x80808080) == 0x00);
			}
			a5_13 = (word32) *a0;
			if (a5_13 != 0x00)
			{
				do
				{
					a0 = (word32) a0 + 1;
					Eq_4072 a5_41 = (word32) *a0;
				} while (a5_41 != 0x00);
				a1Out = a1;
				a2Out.u0 = ~0x01010100;
				a3Out.u0 = 0x80808080;
				a4Out = a4;
				a5Out = a5_41;
				return a0;
			}
		}
l23071070:
		a1Out = a1;
		a2Out = a2;
		a3Out = a3_123;
		a4Out = a4;
		a5Out = a5_13;
		return a0;
	}
	else
	{
		if ((a0 & 3) != 0x00)
		{
			a5_13 = (word32) *a0;
			if (a5_13 != 0x00)
			{
				if ((a1 & 0x00FF) == a5_13)
				{
					a1Out = a1;
					a2Out = a2;
					a3Out = a1 & 0x00FF;
					a4Out = a4;
					a5Out = a5_13;
					return a0;
				}
				do
				{
					a0 = (word16) a0.u0 + 1;
					if ((a0 & 3) == 0x00)
						goto l23070FCC;
					a5_13 = (word32) *a0;
					if (a5_13 == 0x00)
						goto l2307106C;
				} while (a5_13 != (a1 & 0x00FF));
				goto l23071070;
			}
		}
		else
		{
l23070FCC:
			ui32 a1_53 = a1 & 0x00FF | (a1 & 0x00FF) << 0x08;
			int32 a4_56 = *a0;
			ui32 t1_58 = a1_53 << 0x10 | a1_53;
			ui32 a2_60 = t1_58 ^ a4_56;
			a1 = ~a2_60;
			a2 = a1 & a2_60 + ~0x01010100;
			a4 = a4_56 + ~0x01010100;
			if (((~a4_56 & a4_56 + ~0x01010100 | a2) & 0x80808080) == 0x00)
			{
				do
				{
					a0 = (word32) a0 + 4;
					Eq_360480 a4_75 = *a0;
					ui32 a2_77 = a4_75 ^ t1_58;
					a4 = ~a4_75;
					a2 = a2_77 + ~0x01010100 & ~a2_77;
					a1 = a2_77 + ~0x01010100;
				} while ((((word32) a4_75 - 0x01010101 & a4 | a2) & 0x80808080) == 0x00);
			}
			a5_13 = (word32) *a0;
			if (a5_13 != 0x00)
			{
				if ((a1 & 0x00FF) != a5_13)
				{
					do
					{
						a0 = (word32) a0 + 1;
						a5_13 = (word32) *a0;
						if (a5_13 == 0x00)
							goto l2307106C;
					} while (a5_13 != (a1 & 0x00FF));
					a1Out = a1;
					a2Out = a2;
					a3Out = a1 & 0x00FF;
					a4Out = a4;
					a5Out = a5_13;
					return a0;
				}
				goto l23071070;
			}
		}
l2307106C:
		a0.u0 = 0;
		goto l23071070;
	}
}

// 23071100: Register Eq_2 strcmp(Register Eq_2 a0, Register Eq_2 a1, Register out Eq_2 a1Out, Register out Eq_103467 a2Out, Register out Eq_103467 a3Out, Register out (ptr32 Eq_103469) a4Out, Register out Eq_103470 a5Out)
// Called from:
//      bl_msg_update_channel_cfg
//      stateGlobalGuard_scan_beacon
//      cmd_wifi_cfg
//      cmd_blog_info_dump
//      cmd_blog_set_level
//      proc_onecmd
//      ls_cmd
//      echo_cmd
//      hal_boot2_partition_bus_addr
//      hal_boot2_partition_addr
//      inode_open
//      findIndexOfSubscriptionList
//      AckStatusCallback
//      isSubscriptionPresent
//      incrementSubscriptionCnt
//      aws_iot_mqtt_unsubscribe
Eq_2 strcmp(Eq_2 a0, Eq_2 a1, union Eq_2 & a1Out, union Eq_103467 & a2Out, union Eq_103467 & a3Out, struct Eq_103469 & a4Out, union Eq_103470 & a5Out)
{
	ui32 a4_5 = a0 | a1;
	if ((a4_5 & 3) != 0x00)
	{
l2307120C:
		do
		{
			Eq_103467 a2_60 = (word32) *a0;
			Eq_103467 a3_62 = (word32) *a1;
			a0 = (word32) a0 + 1;
			a1 = (word32) a1 + 1;
		} while (a2_60 == a3_62 && a2_60 != 0x00);
		a1Out = a1;
		a2Out = a2_60;
		a3Out = a3_62;
		a4Out = a4_5 & 3;
		a5Out = a5;
		return a2_60 - a3_62;
	}
	else
	{
		a5.u0 = 0x7F7F7F7F;
		do
		{
			Eq_103467 a2_12 = *a0;
			Eq_103467 a3_14 = *a1;
			if (((a2_12 & 0x7F7F7F7F) + 0x7F7F7F7F | (a2_12 | 0x7F7F7F7F)) != -1)
			{
l23071234:
				if (a2_12 != a3_14)
					goto l2307120C;
				a1Out = a1;
				a2Out = a2_12;
				a3Out = a3_14;
				a4Out = a4_5 & 3;
				a5Out.u0 = 0x7F7F7F7F;
				return 0;
			}
			if (a2_12 != a3_14)
				break;
			a2_12 = *((word32) a0 + 4);
			a3_14 = *((word32) a1 + 4);
			if (((a2_12 & 0x7F7F7F7F) + 0x7F7F7F7F | (a2_12 | 0x7F7F7F7F)) != -1)
			{
				a0 = (word32) a0 + 4;
				a1 = (word32) a1 + 4;
				goto l23071234;
			}
			if (a2_12 != a3_14)
				break;
			a2_12 = *((word32) a0 + 8);
			a3_14 = *((word32) a1 + 8);
			if (((a2_12 & 0x7F7F7F7F) + 0x7F7F7F7F | (a2_12 | 0x7F7F7F7F)) != -1)
			{
				a0 = (word32) a0 + 8;
				a1 = (word32) a1 + 8;
				if (a2_12 != a3_14)
					goto l2307120C;
				a1Out = a1;
				a2Out = a2_12;
				a3Out = a3_14;
				a4Out = a4_5 & 3;
				a5Out.u0 = 0x7F7F7F7F;
				return 0;
			}
			if (a2_12 != a3_14)
				break;
			a2_12 = *((word32) a0 + 0x0C);
			a3_14 = *((word32) a1 + 0x0C);
			if (((a2_12 & 0x7F7F7F7F) + 0x7F7F7F7F | (a2_12 | 0x7F7F7F7F)) != -1)
			{
				a0 = (word32) a0 + 0x0C;
				a1 = (word32) a1 + 0x0C;
				if (a2_12 != a3_14)
					goto l2307120C;
				a1Out = a1;
				a2Out = a2_12;
				a3Out = a3_14;
				a4Out = a4_5 & 3;
				a5Out.u0 = 0x7F7F7F7F;
				return 0;
			}
			if (a2_12 != a3_14)
				break;
			a2_12 = *((word32) a0 + 16);
			a3_14 = *((word32) a1 + 16);
			if (((a2_12 & 0x7F7F7F7F) + 0x7F7F7F7F | (a2_12 | 0x7F7F7F7F)) != -1)
			{
				a0 = (word32) a0 + 16;
				a1 = (word32) a1 + 16;
				if (a2_12 != a3_14)
					goto l2307120C;
				a1Out = a1;
				a2Out = a2_12;
				a3Out = a3_14;
				a4Out = a4_5 & 3;
				a5Out.u0 = 0x7F7F7F7F;
				return 0;
			}
			a0 = (word32) a0 + 20;
			a1 = (word32) a1 + 20;
		} while (a2_12 == a3_14);
		Eq_103470 a5_76;
		struct Eq_103469 * a4_75;
		Eq_2 a1_78;
		uint32 a4_72 = a2_12 << 0x10;
		uint32 a5_74 = a3_14 << 0x10;
		if (a4_72 == a5_74)
		{
			a4_75 = a2_12 >> 0x10;
			a5_76 = a3_14 >> 0x10;
			Eq_2 a0_81 = a4_75 - a5_76;
			a1_78 = a0_81 & 0x00FF;
			if ((a0_81 & 0x00FF) == 0x00)
			{
				a1Out = a0_81 & 0x00FF;
				a2Out = a2_12;
				a3Out = a3_14;
				a4Out = a4_75;
				a5Out = a5_76;
				return a0_81;
			}
		}
		else
		{
			Eq_2 a0_77 = (a4_72 >> 0x10) - (a5_74 >> 0x10);
			a4_75 = a4_72 >> 0x10;
			a5_76 = a5_74 >> 0x10;
			a1_78 = a0_77 & 0x00FF;
			if ((a0_77 & 0x00FF) == 0x00)
			{
				a1Out = a0_77 & 0x00FF;
				a2Out = a2_12;
				a3Out = a3_14;
				a4Out = a4_72 >> 0x10;
				a5Out = a5_74 >> 0x10;
				return a0_77;
			}
		}
		a1Out = a1_78;
		a2Out = a2_12;
		a3Out = a3_14;
		struct Eq_103469 * a4_84 = a4_75 & 0x00FF;
		a4Out = a4_84;
		Eq_103470 a5_86 = a5_76 & 0x00FF;
		a5Out = a5_86;
		return a4_84 - a5_86;
	}
}

