pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0007.c
// 2307127C: Register (ptr32 Eq_133241) strcpy(Register Eq_2 a0, Register (ptr32 Eq_133241) a1, Register out ptr32 a4Out, Register out Eq_2 a5Out)
// Called from:
//      cmd_blog_info_dump
//      ps_cmd
//      aos_cli_printf
//      vTaskList
//      bl_chip_memory_ram
//      tcpclient_cmd
//      ipus_test_cmd
//      ipu_test_cmd
//      ipc_test_cmd
//      ips_test_cmd
//      bl_mtd_info
union Eq_133241 * strcpy(Eq_2 a0, union Eq_133241 * a1, ptr32 & a4Out, union Eq_2 & a5Out)
{
	if (((a0 | a1) & 3) != 0x00)
	{
		Eq_2 a5_11 = a0;
		do
		{
			ptr32 a4_10 = (word32) *a1;
			a5_11 = (word32) a5_11 + 1;
			((word32) a5_11 + 0x0FFF)->u1 = (byte) a4_10;
			a1 = (union Eq_133241 *) ((char *) a1 + 1);
		} while (a4_10 != 0x00);
		a4Out = a4_10;
		a5Out = a5_11;
		return a1;
	}
	else
	{
		Eq_2 a2_24;
		int32 a4_16 = *a1;
		if (((a4_16 & 0x7F7F7F7F) + 0x7F7F7F7F | a4_16 | 0x7F7F7F7F) == -1)
		{
			a2_24 = a0;
			do
			{
				a2_24 = (word32) a2_24 + 4;
				*((word32) a2_24 + 0x0FFC) = a4_16;
				a1 = (union Eq_133241 *) ((char *) a1 + 4);
				a4_16 = *a1;
			} while (((a4_16 & 0x7F7F7F7F) + 0x7F7F7F7F | a4_16 | 0x7F7F7F7F) == -1);
		}
		else
			a2_24 = a0;
		Eq_2 a5_42 = (word32) *a1;
		ptr32 a4_43 = (word32) *((char *) a1 + 1);
		word32 a3_44 = (word32) *((char *) a1 + 2);
		a2_24->u1 = (byte) a5_42;
		if (a5_42 != 0x00)
		{
			((word32) a2_24 + 1)->u1 = (byte) a4_43;
			if (a4_43 != 0x00)
			{
				((word32) a2_24 + 2)->u1 = (byte) a3_44;
				if (a3_44 != 0x00)
				{
					((word32) a2_24 + 3)->u1 = 0x00;
					a4Out = a4_43;
					a5Out = a5_42;
					return a1;
				}
			}
		}
		a4Out = a4_43;
		a5Out = a5_42;
		return a1;
	}
}

// 2307132C: Register Eq_2 strlen(Register Eq_2 a0, Register out (ptr32 Eq_3566) a1Out, Register out ptr32 a2Out, Register out (ptr32 Eq_2) a3Out, Register out Eq_2 a4Out, Register out Eq_3570 a5Out)
// Called from:
//      event_cb_wifi_event
//      aws_main_entry
//      mm_sta_add
//      set_psk
//      pmkCacheFindPSK
//      KeyMgmtInit
//      GenerateGTK_internal
//      cm_SetComData
//      ap_setpsk
//      InitializeAp
//      bl_send_apm_start_req
//      stateGlobalGuard_scan_beacon
//      wifi_mgmr_api_ap_start
//      wifi_ap_sta_delete_cmd
//      wifi_mgmr_sta_ssid_set
//      wifi_mgmr_sta_psk_set
//      wifi_mgmr_sta_connect
//      fdt_get_name
//      fdt_subnode_offset
//      fdt_getprop
//      utilfdt_print_data
//      tc_blfdtdump
//      cmd_blog_info_dump
//      cmd_blog_set_level
//      cli_putstr
//      ps_cmd
//      aos_cli_printf
//      ls_cmd
//      cli_main_input
//      find_env_cb
//      find_env
//      del_env
//      create_env_blob
//      ef_get_env_blob
//      ef_del_env
//      ef_set_env
//      psm_erase_cmd
//      vTaskList
//      hal_board_cfg
//      httpc_create_request_string.constprop.6
//      lwip_getaddrinfo
//      dns_check_entry
//      dns_gethostbyname
//      dhcp_option_hostname.isra.0
//      tcpclient_cmd
//      ipus_test_cmd
//      ipu_test_cmd
//      ipc_test_cmd
//      ips_test_cmd
//      romfs_ioctl
//      romfs_read
//      file_info
//      dirent_file
//      romfs_opendir
//      romfs_open
//      romfs_register
//      Bl_F_fast.constprop.0
//      utils_wifi_psk_cal_fast_bin
//      aos_open
//      inode_open
//      inode_reserve
//      aws_iot_shadow_connect
//      aws_iot_shadow_update
//      aws_iot_shadow_add_reported
//      aws_iot_finalize_json_document
//      unsubscribeFromAcceptedAndRejected
//      registerJsonTokenOnDelta
//      subscribeToShadowActionAcks
//      publishToShadowAction
//      jsoneq
//      aws_iot_mqtt_set_connect_params
//      iot_tls_connect
//      Default_Handler
//      Bl_F
//      bl60x_fw_password_hash
//      mbedtls_pk_parse_keyfile
//      tls_prf_sha256
//      mbedtls_ssl_set_hostname
//      mbedtls_ssl_conf_alpn_protocols
//      mbedtls_ssl_free
//      x509_check_wildcard
//      mbedtls_x509_crt_verify_with_profile
//      mbedtls_pem_read_buffer
//      mbedtls_ssl_handshake_client_step
//      mbedtls_ssl_handshake_server_step
//      strstr
Eq_2 strlen(Eq_2 a0, struct Eq_3566 & a1Out, ptr32 & a2Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_3570 & a5Out)
{
	Eq_2 a4_17 = a0;
	if ((a0 & 3) != 0x00)
	{
		do
		{
			a4_17 = (word32) a4_17 + 1;
			Eq_3570 a5_8 = (word32) *a4_17;
			if (a5_8 == 0x00)
			{
				a1Out = a1;
				a2Out = a2;
				a3Out = a4_17 & 3;
				Eq_2 a4_12 = a4_17 - a0;
				a4Out = a4_12;
				a5Out = a5_8;
				return (word32) a4_12 - 1;
			}
		} while ((a4_17 & 3) != 0x00);
	}
	do
	{
		a4_17 = (word32) a4_17 + 4;
		int32 a2_20 = *((word32) a4_17 - 4);
	} while (((a2_20 & 0x7F7F7F7F) + 0x7F7F7F7F | a2_20 | 0x7F7F7F7F) == -1);
	union Eq_2 * a3_27 = (word32) *((word32) a4_17 - 4);
	Eq_3570 a5_30 = a4_17 - a0;
	ptr32 a2_31 = (word32) *((word32) a4_17 - 3);
	word32 a0_32 = (word32) *((word32) a4_17 - 2);
	if (a3_27 == null)
	{
		a1Out = (struct Eq_3566 *) -1;
		a2Out = a2_31;
		a3Out = a3_27;
		a4Out = a4_17;
		a5Out = a5_30;
		return (word32) a5_30 - 4;
	}
	else if (a2_31 == 0x00)
	{
		a1Out = (struct Eq_3566 *) -1;
		a2Out = a2_31;
		a3Out = a3_27;
		a4Out = a4_17;
		a5Out = a5_30;
		return (word32) a5_30 - 3;
	}
	else
	{
		a1Out = (struct Eq_3566 *) -1;
		a2Out = a2_31;
		a3Out = a3_27;
		a4Out = a4_17;
		a5Out = a5_30;
		return (word32) a5_30 + (word32) (a0_32 != 0x00) + -2;
	}
}

// 230713B8: Register Eq_2 strncmp(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register out Eq_2 a1Out, Register out Eq_2 a2Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out)
// Called from:
//      proc_onecmd
//      cli_main_input
//      find_env_cb
//      find_env
//      romfs_open
//      inode_open
//      jsoneq
//      parseBooleanValue
//      aws_iot_mqtt_internal_cycle_read
Eq_2 strncmp(Eq_2 a0, Eq_2 a1, Eq_2 a2, union Eq_2 & a1Out, union Eq_2 & a2Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_2 & a5Out)
{
	if (a2 != 0x00)
	{
		ui32 a5_6 = a0 | a1;
		a5 = a5_6 & 3;
		if ((a5_6 & 3) == 0x00)
		{
			a5.u0 = 3;
			if (a2 > 3)
			{
				a5 = *a0;
				a4 = *a1;
				if (a5 == a4)
				{
					a2 = (word32) a2 - 4;
					if (a2 != ~0x03)
					{
						ui32 a5_18 = (word16) a5.u0 - 0x01010101 & ~a5;
						a4 = (word16) a5.u0 - 0x01010101;
						a5 = a5_18 & 0x80808080;
						if ((a5_18 & 0x80808080) == 0x00)
						{
							do
							{
								a0 = (word32) a0 + 4;
								a1 = (word32) a1 + 4;
								if (a2 <= 3)
									goto l23071444;
								a4 = *a0;
								ui32 a5_34 = (word32) a4 - 0x01010101 & ~a4;
								a3 = *a1;
								a5 = a5_34 & 0x80808080;
								if (a4 != a3)
									goto l23071494;
								a2 = (word32) a2 - 4;
							} while (a2 != 0x00 && (a5_34 & 0x80808080) == 0x00);
						}
					}
					goto l2307148C;
				}
l23071494:
				a4 = (word32) *a0;
				a3 = (word32) *a1;
				a2 = (word32) a2 - 1;
				if (a3 != a4)
				{
l23071484:
					a1Out = a1;
					a2Out = a2;
					a3Out = a3;
					a4Out = a4;
					a5Out = a5;
					return a4 - a3;
				}
				goto l23071458;
			}
		}
l23071444:
		a4 = (word32) *a0;
		a3 = (word32) *a1;
		a2 = (word32) a2 - 1;
		if (a3 != a4)
			goto l23071484;
		if (a2 != 0x00)
		{
l23071458:
			if (a4 != 0x00)
			{
				a5 = (word32) a0 + 1;
				a2 = a0 + a2;
				do
				{
					a1 = (word32) a1 + 1;
					a4 = (word32) *a5;
					a3 = (word32) *a1;
					if (a4 != a3)
						goto l23071484;
					if (a2 == a5)
						break;
					a5 = (word32) a5 + 1;
				} while (a4 != 0x00);
			}
			goto l2307148C;
		}
	}
l2307148C:
	a1Out = a1;
	a2Out = a2;
	a3Out = a3;
	a4Out = a4;
	a5Out = a5;
	return 0;
}

