pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0007.c
// 230714A8: Register Eq_2 strncpy(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2995 a2, Register out Eq_2996 a3Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out)
// Called from:
//      check_dts_config
//      event_cb_wifi_event
//      stateGlobalGuard_scan_beacon
//      wifi_mgmr_set_country_code_internal
//      cli_main_input
//      move_env
//      lwip_gethostbyname
//      romfs_readdir
//      aos_task_new
//      extractClientToken
//      topicNameFromThingAndAction
//      parseStringValue
//      bl_mtd_open
Eq_2 strncpy(Eq_2 a0, Eq_2 a1, Eq_2995 a2, union Eq_2996 & a3Out, union Eq_2 & a4Out, union Eq_2 & a5Out)
{
	Eq_2 a4_25;
	ui32 a5_5 = a1 | a0;
	Eq_2 a5_24 = a5_5 & 3;
	if ((a5_5 & 3) == 0x00)
	{
		a5_24.u0 = 3;
		a4_25 = a0;
		while (a2 > 3)
		{
			a3 = *a1;
			ui32 a5_22 = (word32) a3 - 0x01010101 & ~a3;
			a5_24 = a5_22 & 0x80808080;
			if ((a5_22 & 0x80808080) != 0x00)
				goto l230714C4;
			a4_25 += 4;
			*((word32) a4_25 + 0x0FFC) = a3;
			a2 = (word32) a2 - 4;
			a1 = (word32) a1 + 4;
		}
	}
	else
		a4_25 = a0;
	if (a2 != 0x00)
	{
l230714C4:
		Eq_2996 a6_46;
		word32 a6_38 = (word32) *a1;
		a4_25->u1 = (byte) a6_38;
		a3 = (word32) a2 - 1;
		a1 = (word32) a1 + 1;
		a5_24 = (word32) a4_25 + 1;
		if (a6_38 != 0x00)
		{
			word32 a2_47 = a4_25 + a2;
			a3 = a4_25 + a3;
			do
			{
				a1 = (word32) a1 + 1;
				a6_46 = a3 - a5_24;
				if (a5_24 == a2_47)
				{
					a3Out = a3;
					a4Out = a4_25;
					a5Out = a5_24;
					return a1;
				}
				a4_25 = (word32) *((word32) a1 - 1);
				++a5_24;
				((word32) a5_24 + 0x0FFF)->u1 = (byte) a4_25;
			} while (a4_25 != 0x00);
		}
		else
			a6_46 = a3;
		a4_25 = a5_24 + a6_46;
		if (a6_46 == 0x00)
		{
			a3Out = a3;
			a4Out = a4_25;
			a5Out = a5_24;
			return a1;
		}
		do
		{
			++a5_24;
			((word32) a5_24 + 0x0FFF)->u1 = 0x00;
		} while (a5_24 != a4_25);
	}
	a3Out = a3;
	a4Out = a4_25;
	a5Out = a5_24;
	return a1;
}

// 23071574: Register Eq_2 strnlen(Register Eq_2 a0, Register Eq_2 a1, Register out Eq_2 a1Out, Register out Eq_2 a3Out, Register out (ptr32 byte) a4Out, Register out Eq_2 a5Out)
// Called from:
//      fdt_stringlist_count
//      fdt_stringlist_get
//      flt
//      two_way_long_needle
//      strstr
Eq_2 strnlen(Eq_2 a0, Eq_2 a1, union Eq_2 & a1Out, union Eq_2 & a3Out, byte & a4Out, union Eq_2 & a5Out)
{
	if (a1 != 0x00)
	{
		a5 = (word32) *a0;
		if (a5 != 0x00)
		{
			a3 = a0 + a1;
			a5 = a0;
			do
			{
				a5 = (word32) a5 + 1;
				if (a5 == a3)
					goto l2307159C;
				a4 = (word32) *a5;
			} while (a4 != null);
			Eq_2 a1_16 = a5 - a0;
			a1Out = a1_16;
			a3Out = a3;
			a4Out = a4;
			a5Out = a5;
			return a1_16;
		}
		a1.u0 = 0;
	}
l2307159C:
	a1Out = a1;
	a3Out = a3;
	a4Out = a4;
	a5Out = a5;
	return a1;
}

// 230715B8: Register Eq_2 strrchr(Register Eq_2 a0, Register Eq_2 a1, Register out ptr32 a5Out)
// Called from:
//      fdt_get_name
Eq_2 strrchr(Eq_2 a0, Eq_2 a1, ptr32 & a5Out)
{
	if (a1 == 0x00)
	{
		ptr32 a5_8;
		word32 a1_71;
		word32 a2_72;
		word32 a3_73;
		word32 a4_74;
		Eq_2 a0_9 = strchr(a0, a1, out a1_71, out a2_72, out a3_73, out a4_74, out a5_8);
		a5Out = a5_8;
		return a0_9;
	}
	else
	{
		Eq_2 a5_22 = a0;
		Eq_2 s1_23 = 0;
		while (true)
		{
			ptr32 a5_31;
			word32 a1_67;
			word32 a2_68;
			word32 a3_69;
			word32 a4_70;
			Eq_2 a0_32 = strchr(a5_22, a1, out a1_67, out a2_68, out a3_69, out a4_70, out a5_31);
			if (a0_32 == 0x00)
				break;
			a5_22 = (word32) a0_32 + 1;
			s1_23 = a0_32;
		}
		a5Out = a5_31;
		return s1_23;
	}
}

// 23071610: Register Eq_2 two_way_long_needle(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register out Eq_2 a1Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out)
// Called from:
//      strstr
Eq_2 two_way_long_needle(Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, union Eq_2 & a1Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_2 & a5Out)
{
	Eq_2 s10_221 = a1;
	Eq_2 s7_125 = 1;
	Eq_2 a3_39 = 1;
	Eq_2 a2_40 = 0;
	Eq_2 s11_41 = -1;
l23071668:
	word32 a5_48 = a3_39 + a2_40;
	word32 a4_46 = a2 + s11_41 + a3_39;
	word32 a1_49 = a2 + a5_48;
	while (a5_48 < a3)
	{
		up32 a1_53 = (word32) *a1_49;
		up32 a4_55 = (word32) *a4_46;
		if (a1_53 >= a4_55)
		{
			if (a1_53 != a4_55)
			{
				s11_41 = a2_40;
				s7_125.u0 = 1;
				a2_40 = (word32) a2_40 + 1;
				a3_39.u0 = 1;
			}
			else if (a3_39 != s7_125)
				a3_39 = (word16) a3_39.u0 + 1;
			else
			{
				a2_40 = a5_48;
				a3_39.u0 = 1;
			}
			goto l23071668;
		}
		a5_48 = (word32) a5_48 + 1;
		a2_40 = a5_48;
		a3_39.u0 = 1;
		s7_125 = a5_48 - s11_41;
		a4_46 = a2 + s11_41 + 1;
		a1_49 = a2 + a5_48;
	}
	Eq_2 a7_103 = 1;
	Eq_2 a3_100 = 1;
	Eq_2 a2_101 = 0;
	Eq_2 a1_102 = -1;
l230716B8:
	word32 a5_113 = a3_100 + a2_101;
	word32 a4_112 = a2 + a1_102 + a3_100;
	word32 a0_114 = a2 + a5_113;
	while (a5_113 < a3)
	{
		up32 a0_92 = (word32) *a0_114;
		up32 a4_94 = (word32) *a4_112;
		if (a4_94 >= a0_92)
		{
			if (a0_92 != a4_94)
			{
				a1_102 = a2_101;
				a7_103.u0 = 1;
				a2_101 = (word32) a2_101 + 1;
				a3_100.u0 = 1;
			}
			else if (a3_100 != a7_103)
				a3_100 = (word16) a3_100.u0 + 1;
			else
			{
				a2_101 = a5_113;
				a3_100.u0 = 1;
			}
			goto l230716B8;
		}
		a5_113 = (word32) a5_113 + 1;
		a2_101 = a5_113;
		a3_100.u0 = 1;
		a7_103 = a5_113 - a1_102;
		a4_112 = a2 + a1_102 + 1;
		a0_114 = a2 + a5_113;
	}
	Eq_2 a1_117 = (word32) a1_102 + 1;
	Eq_2 s11_122 = (word32) s11_41 + 1;
	if (a1_117 >= s11_122)
	{
		s7_125 = a7_103;
		s11_122 = a1_117;
	}
	word32 * a5_134 = fp + -0x0440;
	do
	{
		*a5_134 = (word32) a3;
		++a5_134;
	} while (fp + -64 != a5_134);
	word32 a1_145 = a2 + a3;
	Eq_2 a4_146 = a2;
	word32 a2_147 = (word32) a2 + ((word32) a3 - 1);
	if (a3 != 0x00)
	{
		do
		{
			(fp + -64 + ((word32) (*a4_146) << 0x02))->dw0C00 = a2_147 - a4_146;
			a4_146 = (word32) a4_146 + 1;
		} while (a4_146 != a1_145);
	}
	Eq_2 a4_1194;
	Eq_2 a5_1204;
	Eq_2 a0_1153;
	word32 a4_1274;
	word32 a2_1273;
	word32 a5_1275;
	Eq_2 a3_1181;
	Eq_2 a1_1154;
	if (memcmp(a2, a2 + s7_125, s11_122, out a1_1154, out a2_1273, out a3_1181, out a4_1274, out a5_1275) == 0x00)
	{
		word32 s5_332 = s11_122 + -1;
		word32 a5_343 = a0 + s5_332;
		word32 a5_347 = a2 + s5_332;
		Eq_2 s6_349 = 0;
		Eq_2 s8_350 = 0;
		int32 s4_352 = 1 - s11_122;
		do
		{
			word32 a2_356 = a0 + s8_350;
			a4_1194 = fp + -64;
			a5_1204 = (fp + -64 + ((word32) (*((word32) a2_356 + ((word32) a3 - 1))) << 0x02))->tFFFFFC00;
			if (a5_1204 != 0x00)
			{
				if (s6_349 != 0x00 && a5_1204 < s7_125)
					a5_1204 = a3 - s7_125;
l230717C4:
				s8_350 += a5_1204;
				s6_349.u0 = 0;
				goto l230717CC;
			}
			a5_1204 = s6_349;
			if (s6_349 < s11_122)
				a5_1204 = s11_122;
			if (a5_1204 < (word32) a3 - 1)
			{
				word32 a3_375 = a0 + a5_1204 + s8_350;
				a4_1194 = a2 + a5_1204;
				do
				{
					if ((word32) *a3_375 != (word32) (*a4_1194))
					{
						s8_350 = (word32) s8_350 + s4_352;
						goto l230717C4;
					}
					++a5_1204;
					a3_375 = a2 + a5_1204;
					a4_1194 = a0 + (a5_1204 + s8_350);
				} while (a5_1204 < (word32) a3 - 1);
			}
			a3_1181 = s5_332;
			if (s6_349 < s11_122)
			{
				a4_1194 = (word32) *((word32) s8_350 + a5_343);
				a5_1204 = (word32) *a5_347;
				if (a4_1194 != a5_1204)
					goto l23071A68;
				while (true)
				{
					a4_1194 = a3_1181 + -1;
					a1_1154 = a2 + a4_1194;
					a5_1204 = a0 + (a4_1194 + s8_350);
					if (s6_349 == a3_1181)
						break;
					a1_1154 = (word32) *a1_1154;
					a5_1204 = (word32) *a5_1204;
					if (a1_1154 != a5_1204)
						break;
					a3_1181 = a4_1194;
				}
				if (a3_1181 >= (word16) s6_349.u0 + 1)
					goto l230718F4;
l23071A74:
				a0_1153 = a2_356;
				goto l230717F0;
			}
l23071A68:
			a3_1181 = s11_122;
			if (s11_122 < (word16) s6_349.u0 + 1)
				goto l23071A74;
l230718F4:
			s8_350 += s7_125;
			s6_349 = a3 - s7_125;
l230717CC:
			if (s10_221 - a3 >= s8_350)
				continue;
			word32 a5_1276;
			s10_221 += strnlen(a0 + s10_221, a3 | 0x0800, out a1_1154, out a3_1181, out a4_1194, out a5_1276);
			a5_1204 = s10_221 - a3;
		} while (a5_1204 >= s8_350);
l230717EC:
		a0_1153.u0 = 0;
		goto l230717F0;
	}
	Eq_2 s7_186 = a3 - s11_122;
	if (s7_186 < s11_122)
		s7_186 = s11_122;
	word32 s5_189 = s11_122 + -1;
	word32 a5_192 = a2 + s5_189;
	word32 s7_196 = s7_186 + 1;
	Eq_2 s8_197 = 0;
	word32 s6_202 = s11_122 + -2;
	int32 s4_203 = 1 - s11_122;
l2307194C:
	a1_1154 = a0 + s8_197;
	Mem211 = Mem201;
	int32 a5_217 = (fp + -64 + ((word32) (*((word32) a1_1154 + ((word32) a3 - 1))) << 0x02))->dwFFFFFC00;
	while (a5_217 != 0x00)
	{
		s8_197 = (word32) s8_197 + a5_217;
l23071970:
		Mem239 = Mem201;
		if (s10_221 - a3 >= s8_197)
			goto l2307194C;
		word32 a5_1277;
		s10_221 += strnlen(a0 + s10_221, a3 | 0x0800, out a1_1154, out a3_1181, out a4_1194, out a5_1277);
		a5_1204 = s10_221 - a3;
		if (a5_1204 < s8_197)
			goto l230717EC;
		a1_1154 = a0 + s8_197;
		a5_217 = (fp + -64 + ((word32) (*((word32) a1_1154 + ((word32) a3 - 1))) << 0x02))->dwFFFFFC00;
	}
	a4_1194 = fp + -64;
	Mem256 = Mem201;
	if (s11_122 < (word32) a3 - 1)
	{
		Eq_2 a5_259 = s11_122;
		if (CONVERT(Mem256[a1_1154 + s11_122:byte], byte, word32) == CONVERT(Mem256[a2 + s11_122:byte], byte, word32))
		{
			do
			{
				++a5_259;
				word32 a2_265 = a2 + a5_259;
				a4_1194 = a0 + (s8_197 + a5_259);
				if (a5_259 >= (word32) a3 - 1)
					goto l230719F0;
			} while ((word32) *a2_265 == (word32) (*a4_1194));
		}
		a3_1181 = (word32) s8_197 + s4_203;
		s8_197 = a3_1181 + a5_259;
	}
	else
	{
l230719F0:
		a5_1204.u0 = -1;
		if (s5_189 == (byte *) -1)
		{
l23071A7C:
			a0_1153 = a1_1154;
l230717F0:
			a1Out = a1_1154;
			a3Out = a3_1181;
			a4Out = a4_1194;
			a5Out = a5_1204;
			return a0_1153;
		}
		if (CONVERT(Mem256[a1_1154 + s5_189:byte], byte, word32) == CONVERT(Mem256[a5_192 + 0x00:byte], byte, word32))
		{
			a5_1204 = a2 + s6_202;
			a4_1194 = a0 + (s8_197 + s6_202);
			do
			{
				if (a5_1278 == (word32) a2 - 1)
					goto l23071A7C;
				a5_1204 = (word32) a5_1278 - 1;
				a4_1194 = (word32) a4_1279 - 1;
				a5_1278 = a5_1204;
				a4_1279 = a4_1194;
			} while ((word32) *a5_1278 == (word32) (*a4_1279));
		}
		s8_197 += s7_196;
	}
	goto l23071970;
}

// 23071A84: Register Eq_2 strstr(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register out Eq_2 a1Out, Register out (ptr32 Eq_133368) a3Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out)
// Called from:
//      cmd_blog_info_dump
//      ota_tcp_cmd
//      AckStatusCallback
//      mbedtls_pk_load_file
//      mbedtls_x509_crt_parse
//      mbedtls_pem_read_buffer
Eq_2 strstr(Eq_2 ra, Eq_2 a0, Eq_2 a1, union Eq_2 & a1Out, struct Eq_133368 & a3Out, union Eq_2 & a4Out, union Eq_2 & a5Out)
{
	Eq_2 a1_104 = (word32) *a1;
	Eq_2 s0_121 = a0;
	if (a1_104 == 0x00)
	{
l23071BA8:
		a1Out = a1_104;
		a3Out = a3;
		a4Out = a4;
		a5Out = a5;
		return s0_121;
	}
	else
	{
		a3 = (word32) *((word32) a1 + 1);
		if (a3 == null)
		{
			word32 a2_407;
			s0_121 = strchr(a0, a1_104, out a1_104, out a2_407, out a3, out a4, out a5);
			goto l23071BA8;
		}
		ui32 a2_34 = (word32) *((word32) a1 + 2);
		if (a2_34 != 0x00)
		{
			a4 = (word32) *((word32) a1 + 3);
			if (a4 != 0x00)
			{
				if ((word32) *((word32) a1 + 4) != 0x00)
				{
					word32 a3_410;
					word32 a5_412;
					word32 a1_408;
					word32 a2_409;
					word32 a4_411;
					Eq_2 a0_94 = strlen(a1, out a1_408, out a2_409, out a3_410, out a4_411, out a5_412);
					Eq_2 a0_103 = strnlen(a0, a0_94 | 0x0200, out a1_104, out a3, out a4, out a5);
					if (a0_103 >= a0_94)
					{
						if (a0_94 <= 0x00FE)
						{
							word32 a4_416;
							word32 a5_417;
							word32 a0_414;
							word32 a2_415;
							word32 t1_413;
							memset(ra, fp + -96, (word32) a0_94 + 1, 64, out t1_413, out a0_414, out a1_104, out a2_415, out a3, out a4_416, out a5_417);
							word32 s3_126 = a0 + (a0_103 - a0_94);
							if (a0_94 != 0x00)
							{
								Eq_2 a4_137 = a1;
								a1_104 = a0_94 + a1;
								word32 a2_139 = a1 + (a0_94 & 0x00FF);
								do
								{
									a3 = a2_139 - a4_137;
									(fp + -32 + ((word32) (*a4_137) & 63))->b0FC0 = (byte) a3;
									++a4_137;
								} while (a1_104 != a4_137);
							}
							do
							{
								word32 s0_155 = s0_121 + -1;
								a4 = fp + -32;
								for (s0_121 = s0_155 + CONVERT(Mem231[((fp + -32) + (CONVERT(Mem231[s0_155 + a0_94:byte], byte, word32) & 63)) + -64:byte], byte, word32); s3_126 >= s0_121; s0_121 += s4_180)
								{
									word32 s4_180 = CONVERT(Mem231[fp + -32 + (CONVERT(Mem231[s0_121 + a0_94:byte], byte, word32) & 63) + -64:byte], byte, word32);
									word32 a2_418;
									if (memcmp(s0_121, a1, a0_94, out a1_104, out a2_418, out a3, out a4, out a5) == 0x00)
										goto l23071BA8;
								}
								word32 a0_191 = s3_126 + a0_94;
								a5 = (word32) *a0_191;
								if (a5 == 0x00)
									goto l23071C58;
								s3_126 += strnlen(a0_191, 0x0800, out a1_104, out a3, out a4, out a5);
							} while (s3_126 >= s0_121);
							s0_121.u0 = 0;
						}
						else
							s0_121 = two_way_long_needle(a0, a0_103, a1, a0_94, out a1_104, out a3, out a4, out a5);
						goto l23071BA8;
					}
				}
				else
				{
					a1_104 <<= 0x18;
					a3 = (word32) *a0;
					a5 = a1_104 << 0x18 | a3 << 0x10 | a4 | a2_34 << 0x08;
					if (a3 != null)
					{
						a4.u0 = 0;
						while (true)
						{
							a4 = a3 | a4 << 0x08;
							a3 = (word32) *((word16) s0_121.u0 + 1);
							word32 a2_88 = s0_121 + 1;
							if (a3 == null)
								break;
							if (a5 == a4)
								goto l23071CE0;
							s0_121 = a2_88;
						}
						if (a5 == a4)
						{
l23071CE0:
							s0_121 += -3;
							goto l23071BA8;
						}
					}
				}
			}
			else
			{
				a4 = (word32) *a0;
				a1_104 = a3 << 0x10;
				a5 = a1_104 << 0x18 | a3 << 0x10 | a2_34 << 0x08;
				if (a4 != 0x00)
				{
					a4 <<= 0x08;
					Eq_2 a2_59 = (word32) a0 + 1;
					a3 = (word32) *((word32) a0 + 1);
					while (true)
					{
						ui32 a4_63 = a3 | a4;
						a4 = a4_63 << 0x08;
						if (a3 == null)
							break;
						a1_104 = (word32) a2_59 + 1;
						a3 = (word32) *((word32) a2_59 + 1);
						if (a5 == a4_63 << 0x08)
						{
							s0_121 = a2_59 + -2;
							goto l23071BA8;
						}
						a2_59 = a1_104;
					}
				}
			}
		}
		else
		{
			a5 = (word32) *a0;
			a1_104 = a1_104 << 0x10 | a3;
			if (a5 != 0x00)
			{
				a3 = (word32) a0 + 1;
				a4 = (word32) *((word32) a0 + 1);
				while (true)
				{
					a5 = a4 | a5 << 0x10;
					if (a4 == 0x00)
						break;
					struct Eq_133368 * a2_45 = a3 + 1;
					a4 = (word32) a3[1];
					if (a1_104 == a5)
					{
						s0_121 = (char *) a3 - 1;
						goto l23071BA8;
					}
					a3 = a2_45;
				}
			}
		}
l23071C58:
		s0_121.u0 = 0;
		goto l23071BA8;
	}
}

// 23071D04: Register (ptr32 Eq_2) _strtol_l.isra.0(Register (ptr32 Eq_2) a0, Register Eq_2 a1, Register (ptr32 Eq_2) a2, Register Eq_139492 a3, Register out Eq_2 a1Out, Register out Eq_139492 a3Out, Register out Eq_2 a4Out, Register out Eq_361890 a5Out)
// Called from:
//      _strtol_r
//      strtol_l
//      strtol
union Eq_2 * _strtol_l.isra.0(union Eq_2 * a0, Eq_2 a1, union Eq_2 * a2, Eq_139492 a3, union Eq_2 & a1Out, union Eq_139492 & a3Out, union Eq_2 & a4Out, union Eq_361890 & a5Out)
{
	Eq_2 t1_11 = a1;
	while (true)
	{
		Eq_2 a4_125 = (word32) t1_11 + 1;
		Eq_361895 a5_17 = (word32) *((word32) a4_125 - 1);
		if (((word32) *((word32) a5_17.u0 + 587783277) & 8) == 0x00)
			break;
		t1_11 = a4_125;
	}
	Eq_361895 a6_183;
	Eq_139492 t6_46;
	int32 s0_25;
	if (a5_17 != 45)
	{
		if (a5_17 == 43)
		{
			a6_183 = (word32) *a4_125;
			s0_25 = 0;
			a4_125 = (word32) t1_11 + 2;
			if (a3 != 0x00)
			{
l23071D5C:
				t6_46 = a3;
				if (a3 != 16)
					goto l23071D68;
				if (a6_183 != 48 || ((word32) (*a4_125) & 223) != 88)
				{
					t6_46.u0 = 16;
					goto l23071D68;
				}
l23071E8C:
				a6_183 = (word32) *((word32) a4_125 + 1);
				t6_46.u0 = 16;
				a4_125 = (word32) a4_125 + 2;
				a3.u0 = 16;
				goto l23071D68;
			}
l23071DE0:
			if (a6_183 != 48)
			{
				t6_46.u0 = 0x0A;
				a3.u0 = 0x0A;
			}
			else
			{
				if (((word32) *a4_125 & 223) == 88)
					goto l23071E8C;
				t6_46.u0 = 8;
				a3.u0 = 8;
			}
l23071D68:
			union Eq_2 * t0_122 = (union Eq_2 *) 0x80000000;
			if (s0_25 == 0x00)
				t0_122 = (union Eq_2 *) 0x7FFFFFFF;
			Eq_139492 s1_78 = t0_122 & t6_46;
			int32 a7_158 = 0;
			union Eq_2 * a0_108 = null;
			union Eq_2 * t4_84 = t0_122 >> t6_46;
l23071D90:
			Eq_139492 a5_166 = (word32) a6_183 - 48;
			if (a5_166 > 9)
			{
				if (a6_183 > -90)
				{
					if (a6_183 <= -122)
					{
						a5_166 = (word32) a6_183 - 87;
						if (a5_166 < a3)
						{
l23071DA8:
							if (a7_158 != -1)
							{
								a7_158 = -1;
								if (t4_84 >= a0_108 && (t4_84 != a0_108 || s1_78 >= a5_166))
								{
									a7_158 = 1;
									a0_108 = a5_166 + (t6_46 + a0_108);
								}
							}
							a4_125 = (word32) a4_125 + 1;
							a6_183 = (word32) *((word32) a4_125 - 1);
							goto l23071D90;
						}
					}
l23071E04:
					Eq_361890 a5_100 = -1;
					if (a7_158 != -1)
					{
						if (s0_25 != 0x00)
							a0_108 = 0x00 - a0_108;
						if (a2 != null)
						{
							if (a7_158 == 0x00)
								goto l23071E1C;
							t0_122 = a0_108;
l23071E48:
							a1 = (word32) a4_125 - 1;
							a0_108 = t0_122;
l23071E1C:
							*a2 = (union Eq_2 *) a1;
							goto l23071E20;
						}
					}
					else
					{
						*a0 = (union Eq_2 *) 0x0022;
						a5_100.u0 = 0x0022;
						a0_108 = t0_122;
						if (a2 != null)
							goto l23071E48;
					}
l23071E20:
					a1Out = a1;
					a3Out = a3;
					a4Out = a4_125;
					a5Out = a5_100;
					return a0_108;
				}
				a5_166 = (word32) a6_183 - 55;
			}
			if (a5_166 < a3)
				goto l23071DA8;
			goto l23071E04;
		}
		a6_183 = a5_17;
		s0_25 = 0;
	}
	else
	{
		a6_183 = (word32) *a4_125;
		s0_25 = 1;
		a4_125 = (word32) t1_11 + 2;
	}
	if (a3 != 0x00)
		goto l23071D5C;
	goto l23071DE0;
}

// 23071EBC: void _strtol_r(Register (ptr32 Eq_2) a0, Register Eq_2 a1, Register (ptr32 Eq_2) a2, Register Eq_139492 a3)
// Called from:
//      _atoi_r
void _strtol_r(union Eq_2 * a0, Eq_2 a1, union Eq_2 * a2, Eq_139492 a3)
{
	word32 a1_21;
	word32 a3_22;
	word32 a4_23;
	word32 a5_24;
	_strtol_l.isra.0(a0, a1, a2, a3, out a1_21, out a3_22, out a4_23, out a5_24);
}

// 23071EC0: void strtol_l(Register Eq_2 a0, Register (ptr32 Eq_2) a1, Register Eq_139492 a2)
void strtol_l(Eq_2 a0, union Eq_2 * a1, Eq_139492 a2)
{
	union Eq_2 * a0_12 = g_ptr4200D994;
	word32 a1_27;
	word32 a3_28;
	word32 a4_29;
	word32 a5_30;
	_strtol_l.isra.0(a0_12, a0, a1, a2, out a1_27, out a3_28, out a4_29, out a5_30);
}

// 23071EDC: Register Eq_2 strtol(Register Eq_2 a0, Register (ptr32 Eq_2) a1, Register Eq_139492 a2, Register out ptr32 a1Out, Register out (ptr32 Eq_2) a2Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out)
// Called from:
//      mmem_cmd
//      pmem_cmd
//      atoi
Eq_2 strtol(Eq_2 a0, union Eq_2 * a1, Eq_139492 a2, ptr32 & a1Out, union Eq_2 & a2Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out)
{
	union Eq_2 * a0_12 = g_ptr4200D994;
	ptr32 a3_14;
	ptr32 a4_15;
	ptr32 a5_16;
	ptr32 a1_26;
	Eq_2 a0_13 = _strtol_l.isra.0(a0_12, a0, a1, a2, out a1_26, out a3_14, out a4_15, out a5_16);
	a1Out = a1_26;
	a2Out = a1;
	a3Out = a3_14;
	a4Out = a4_15;
	a5Out = a5_16;
	return a0_13;
}

// 23071EF8: void stat(Register int32 a0, Register (ptr32 Eq_362078) a1)
void stat(int32 a0, struct Eq_362078 * a1)
{
	union Eq_2 * a0_10 = g_ptr4200D994;
	_stat_r(a0_10, a0, a1);
}

// 23071F10: void _stat_r(Register (ptr32 Eq_2) a0, Register int32 a1, Register (ptr32 Eq_362078) a2)
// Called from:
//      stat
void _stat_r(union Eq_2 * a0, int32 a1, struct Eq_362078 * a2)
{
	g_t42020D50.u0 = 0x00;
	if (_stat(a1, a2) != -1)
		return;
	Eq_2 a5_35 = g_t4201FD50;
	if (a5_35 == 0x00)
		return;
	*a0 = (union Eq_2 *) a5_35;
}

// 23071F74: Register int32 _stat(Register int32 a0, Register (ptr32 Eq_362078) a1)
// Called from:
//      _stat_r
int32 _stat(int32 a0, struct Eq_362078 * a1)
{
	__syscall();
	int32 s0_19 = a0;
	if (a0 < 0x00)
	{
		word32 a5_55;
		*__errno(out a5_55) = 0x00 - a0;
		s0_19 = -1;
	}
	_conv_stat(a1, fp + -144);
	return s0_19;
}

// 23071FE4: void _conv_stat(Register (ptr32 Eq_362078) a0, Register (ptr32 Eq_362124) a1)
// Called from:
//      _stat
void _conv_stat(struct Eq_362078 * a0, struct Eq_362124 * a1)
{
	int32 t2_6 = a1->dw0014;
	int32 t0_7 = a1->dw0018;
	int32 t6_8 = a1->dw001C;
	int32 t5_9 = a1->dw0020;
	int32 t4_10 = a1->dw0030;
	int32 t3_11 = a1->dw0040;
	int32 t1_12 = a1->dw0038;
	int32 a6_13 = a1->dw0048;
	int32 a7_14 = a1->dw004C;
	int32 a2_15 = a1->dw0058;
	int32 s0_20 = a1->dw0010;
	int32 s1_21 = a1->dw0008;
	int32 a3_25 = a1->dw005C;
	int32 a4_26 = a1->dw0068;
	int32 a5_27 = a1->dw006C;
	a0->w0000 = a1->w0000;
	a0->w0002 = (word16) s1_21;
	a0->dw0004 = s0_20;
	a0->w0008 = (word16) t2_6;
	a0->w000A = (word16) t0_7;
	a0->w000C = (word16) t6_8;
	a0->w000E = (word16) t5_9;
	a0->dw0010 = t4_10;
	a0->dw0048 = t3_11;
	a0->dw0044 = t1_12;
	a0->dw0018 = a6_13;
	a0->dw001C = a7_14;
	a0->dw0028 = a2_15;
	a0->dw002C = a3_25;
	a0->dw0038 = a4_26;
	a0->dw003C = a5_27;
}

